notes/y2/databases.org
#+TITLE: Databases 2
#+DATE: [2017-09-11 Mon 12:14]
#+AUTHOR: Damian Chrzanowski
#+EMAIL: pjdamian.chrzanowski@gmail.com
#+OPTIONS: H:2 toc:2
#+HTML_HEAD: <link href="https://fonts.googleapis.com/css?family=Source+Sans+Pro" rel="stylesheet">
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../assets/org.css"/>
#+HTML_HEAD: <link rel="icon" href="../assets/favicon.ico">

[[file:index.org][Home Page]]

* Database and Database Management System (DBMS)

** Definition
   - Organised collection of data
   - The data refers to several applications
   - The data should not contain any duplicates
   - Models relevant aspects of reality, supports processes requiring this information
   - Started in the mid 1960s, known as "Codasyl Approach"
   - 1970s relational DBMS was born
     - Edgar Codd at IBM wrote "A Relational Model of Data for Large Shared Data Banks"
     - said spec was used in Berkley to create INGRES

** Data vs Information
   - Data: Raw facts, building blocks of information, unprocessed information
   - Information: Data procecssed to reveal meaning

** Database vs DBMS
   - Database: shared, integrated computer structure that houses: end user data (raw facts), metadata (data about data)
   - DBMS:
     - Collection of programs that manages database structure and controls access to data
     - Possible to share data among multiple applications or users
     - Makes data management more efficient and effective
     - Performs functions that guarantee integrity and consistency of data
       - Data dictionary management
       - Data storage management
       - Data transformation and presentation
       - Security management
       - Multi-user access control
       - Backup and recovery management
       - Data integrity management
       - DAtabase access languages and application programming interfaces
       - Database communication interfaces
   - *End user have better access to more and better-managed data*

** Types of databases
   - Single-user
   - Desktop
   - Multi-user
   - Workgroup
   - Enterprise

** Location of Databases
   - Centralized, data at a single site
   - Distributed, data distributed across several sites

** Uses of Databases
   - Transactional (or production), supports a company's day to day operations
   - Data warehouse, stores data to generate information required for tactical or strategic desicions, often used to store historical data

** Why design databases
   - Define expected use
   - Different approach is necessary for different types
   - Avoid redundant data
   - Poor design may lead to errors, bad desicions and potentially to an failure of the organisation

** Database System Environment
   - Hardware
   - Software
     - OS Software
     - DBMS Software
     - Application programs and utilities
   - People
   - Procedures
   - Data

** Advantages and Disadvantages of DB processing

*** Advantages
    - More information can be produced for a given amount of data, ie combining facts
    - Reduce Data Duplicates
    - Creation of program/data independence

*** Disadvantages
    - Expensive (DBMS = additional software)
    - Complex structures and inter-relationships difficulty
    - Security and Accuracy (Integrity) problems

* Data Model

** Definition
   - Relatively simple representation, usually graphical of complex real-world data structures
   - Communications tool to facilitate interaction among the designer, the applications programmer, and the end user
   - Good database model has an appropriate data model at its foundation
   - End-users have different needs and views for the data
   - Data model organises data for various users

