notes/y2/databases.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-12-13 Thu 20:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Databases 2</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Damian Chrzanowski" />
<link href="https://fonts.googleapis.com/css?family=Source+Sans+Pro" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="../assets/org.css"/>
<link rel="icon" href="../assets/favicon.ico">
</head>
<body>
<div id="content">
<h1 class="title">Databases 2</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7f0501e">1. Database and Database Management System (DBMS)</a>
<ul>
<li><a href="#orgf44b1dc">1.1. Definition</a></li>
<li><a href="#orge9b18c2">1.2. Data vs Information</a></li>
<li><a href="#orgff4e735">1.3. Database vs DBMS</a></li>
<li><a href="#orgaa1303d">1.4. Types of databases</a></li>
<li><a href="#orgb3c6cd8">1.5. Location of Databases</a></li>
<li><a href="#orgcd6fc11">1.6. Uses of Databases</a></li>
<li><a href="#org0f01c48">1.7. Why design databases</a></li>
<li><a href="#orga4a0d57">1.8. Database System Environment</a></li>
<li><a href="#org71d5e23">1.9. Advantages and Disadvantages of DB processing</a></li>
</ul>
</li>
<li><a href="#org5d142e0">2. Data Model</a>
<ul>
<li><a href="#orgcd2d75b">2.1. Definition</a></li>
<li><a href="#org21eef50">2.2. Basic building blocks</a></li>
<li><a href="#org7f0ee88">2.3. Evolution of data models</a></li>
<li><a href="#org186db9a">2.4. Entity Model as in Entity Relationship (ER)</a></li>
<li><a href="#org020944e">2.5. Conceptual Model</a></li>
<li><a href="#org0cc8a31">2.6. Internal Model</a></li>
<li><a href="#org822de14">2.7. External Model</a></li>
<li><a href="#org6942ae6">2.8. The Physical Model</a></li>
<li><a href="#org32a3047">2.9. Database Users</a></li>
<li><a href="#org120848b">2.10. User languages, Data Sublanguage (DSL)</a></li>
</ul>
</li>
<li><a href="#orgd0223c5">3. Relational Database Model</a>
<ul>
<li><a href="#orgc4572ab">3.1. Relational Model</a></li>
<li><a href="#orgd0d8e26">3.2. Table</a></li>
</ul>
</li>
<li><a href="#org77257fa">4. College access</a></li>
<li><a href="#orgf376dd0">5. Basic queries on databases</a>
<ul>
<li><a href="#orgdd9977e">5.1. Show all local databases</a></li>
<li><a href="#org88b5f2b">5.2. Change the current database</a></li>
<li><a href="#org6bf6b02">5.3. Create new database</a></li>
</ul>
</li>
<li><a href="#org7ef60a2">6. Basic queries on tables</a>
<ul>
<li><a href="#org13ede84">6.1. Show all tables within the database</a></li>
<li><a href="#org794e75c">6.2. Show information about a table</a></li>
<li><a href="#org45b5d21">6.3. Deleting a table</a></li>
<li><a href="#org197b5e8">6.4. Creating a table</a></li>
<li><a href="#org2f09a76">6.5. Removing a table</a></li>
</ul>
</li>
<li><a href="#org1a99372">7. Inserting data</a>
<ul>
<li><a href="#orgb1a93e0">7.1. Inserting data into the table</a></li>
</ul>
</li>
<li><a href="#org4d56124">8. Deleting data</a>
<ul>
<li><a href="#orgb44f040">8.1. Deleting information</a></li>
</ul>
</li>
<li><a href="#org8c62035">9. Updating data example</a></li>
<li><a href="#org14983da">10. Selecting data</a>
<ul>
<li><a href="#orgb553809">10.1. Select all from a table</a></li>
<li><a href="#orgb81d553">10.2. Selecting specific columns, aka Projection</a></li>
<li><a href="#org6b58257">10.3. Selecting distinct data from columns</a></li>
<li><a href="#org8226e1d">10.4. Selecting specific columns and renaming them</a></li>
<li><a href="#org0a6650d">10.5. Selecting specific columns with a condition</a></li>
<li><a href="#org82597c8">10.6. Selecting data in-between values</a></li>
</ul>
</li>
<li><a href="#orgeed31c9">11. Using wildcards</a></li>
<li><a href="#org01195c2">12. Ordering selected data</a>
<ul>
<li><a href="#org2c64777">12.1. Ordering data</a></li>
</ul>
</li>
<li><a href="#org13dc213">13. Expressions</a>
<ul>
<li><a href="#org1b6fb34">13.1. Calculation and expressions in the query</a></li>
</ul>
</li>
<li><a href="#org045edc4">14. Aggregation functions</a>
<ul>
<li><a href="#orga62a0af">14.1. Count</a></li>
<li><a href="#orgf845cea">14.2. Max</a></li>
<li><a href="#orgfde02d3">14.3. Min</a></li>
<li><a href="#org37335bc">14.4. Average</a></li>
<li><a href="#org3d0b3fe">14.5. Sum</a></li>
</ul>
</li>
<li><a href="#org38777f0">15. Having clause</a></li>
<li><a href="#org74c7077">16. Limit clause</a></li>
<li><a href="#org2dff419">17. Subqueries</a></li>
<li><a href="#orgf3f1478">18. Complex queries</a>
<ul>
<li><a href="#orgc6d8abd">18.1. Union example (both need to have the same column count)</a></li>
<li><a href="#org95cf2bf">18.2. Inner join (intersection)</a></li>
<li><a href="#org1dd2524">18.3. Except (<code>NOT EXISTS</code>), basically set A - B</a></li>
<li><a href="#org6501c52">18.4. Division</a></li>
</ul>
</li>
<li><a href="#org9527040">19. Time and Date functions</a></li>
<li><a href="#org1bdc738">20. Random numbers</a></li>
<li><a href="#orgc27180a">21. Sample DVD DB questions</a></li>
<li><a href="#org3c291d9">22. Sample questions for the test</a></li>
<li><a href="#orgb4e1219">23. Table creation example</a></li>
<li><a href="#orga4c0faf">24. Sample database insert</a></li>
</ul>
</div>
</div>
<p>
<a href="index.html">Home Page</a>
</p>

<div id="outline-container-org7f0501e" class="outline-2">
<h2 id="org7f0501e"><span class="section-number-2">1</span> Database and Database Management System (DBMS)</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgf44b1dc" class="outline-3">
<h3 id="orgf44b1dc"><span class="section-number-3">1.1</span> Definition</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Organised collection of data</li>
<li>The data refers to several applications</li>
<li>The data should not contain any duplicates</li>
<li>Models relevant aspects of reality, supports processes requiring this information</li>
<li>Started in the mid 1960s, known as "Codasyl Approach"</li>
<li>1970s relational DBMS was born
<ul class="org-ul">
<li>Edgar Codd at IBM wrote "A Relational Model of Data for Large Shared Data Banks"</li>
<li>said spec was used in Berkley to create INGRES</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orge9b18c2" class="outline-3">
<h3 id="orge9b18c2"><span class="section-number-3">1.2</span> Data vs Information</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Data: Raw facts, building blocks of information, unprocessed information</li>
<li>Information: Data procecssed to reveal meaning</li>
</ul>
</div>
</div>

<div id="outline-container-orgff4e735" class="outline-3">
<h3 id="orgff4e735"><span class="section-number-3">1.3</span> Database vs DBMS</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Database: shared, integrated computer structure that houses: end user data (raw facts), metadata (data about data)</li>
<li>DBMS:
<ul class="org-ul">
<li>Collection of programs that manages database structure and controls access to data</li>
<li>Possible to share data among multiple applications or users</li>
<li>Makes data management more efficient and effective</li>
<li>Performs functions that guarantee integrity and consistency of data
<ul class="org-ul">
<li>Data dictionary management</li>
<li>Data storage management</li>
<li>Data transformation and presentation</li>
<li>Security management</li>
<li>Multi-user access control</li>
<li>Backup and recovery management</li>
<li>Data integrity management</li>
<li>DAtabase access languages and application programming interfaces</li>
<li>Database communication interfaces</li>
</ul></li>
</ul></li>
<li><b>End user have better access to more and better-managed data</b></li>
</ul>
</div>
</div>

<div id="outline-container-orgaa1303d" class="outline-3">
<h3 id="orgaa1303d"><span class="section-number-3">1.4</span> Types of databases</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Single-user</li>
<li>Desktop</li>
<li>Multi-user</li>
<li>Workgroup</li>
<li>Enterprise</li>
</ul>
</div>
</div>

<div id="outline-container-orgb3c6cd8" class="outline-3">
<h3 id="orgb3c6cd8"><span class="section-number-3">1.5</span> Location of Databases</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>Centralized, data at a single site</li>
<li>Distributed, data distributed across several sites</li>
</ul>
</div>
</div>

<div id="outline-container-orgcd6fc11" class="outline-3">
<h3 id="orgcd6fc11"><span class="section-number-3">1.6</span> Uses of Databases</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>Transactional (or production), supports a company's day to day operations</li>
<li>Data warehouse, stores data to generate information required for tactical or strategic desicions, often used to store historical data</li>
</ul>
</div>
</div>

<div id="outline-container-org0f01c48" class="outline-3">
<h3 id="org0f01c48"><span class="section-number-3">1.7</span> Why design databases</h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li>Define expected use</li>
<li>Different approach is necessary for different types</li>
<li>Avoid redundant data</li>
<li>Poor design may lead to errors, bad desicions and potentially to an failure of the organisation</li>
</ul>
</div>
</div>

<div id="outline-container-orga4a0d57" class="outline-3">
<h3 id="orga4a0d57"><span class="section-number-3">1.8</span> Database System Environment</h3>
<div class="outline-text-3" id="text-1-8">
<ul class="org-ul">
<li>Hardware</li>
<li>Software
<ul class="org-ul">
<li>OS Software</li>
<li>DBMS Software</li>
<li>Application programs and utilities</li>
</ul></li>
<li>People</li>
<li>Procedures</li>
<li>Data</li>
</ul>
</div>
</div>

<div id="outline-container-org71d5e23" class="outline-3">
<h3 id="org71d5e23"><span class="section-number-3">1.9</span> Advantages and Disadvantages of DB processing</h3>
<div class="outline-text-3" id="text-1-9">
</div>
<ol class="org-ol">
<li><a id="orgb077231"></a>Advantages<br />
<div class="outline-text-4" id="text-1-9-1">
<ul class="org-ul">
<li>More information can be produced for a given amount of data, ie combining facts</li>
<li>Reduce Data Duplicates</li>
<li>Creation of program/data independence</li>
</ul>
</div>
</li>

<li><a id="orge3a042b"></a>Disadvantages<br />
<div class="outline-text-4" id="text-1-9-2">
<ul class="org-ul">
<li>Expensive (DBMS = additional software)</li>
<li>Complex structures and inter-relationships difficulty</li>
<li>Security and Accuracy (Integrity) problems</li>
</ul>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-org5d142e0" class="outline-2">
<h2 id="org5d142e0"><span class="section-number-2">2</span> Data Model</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgcd2d75b" class="outline-3">
<h3 id="orgcd2d75b"><span class="section-number-3">2.1</span> Definition</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Relatively simple representation, usually graphical of complex real-world data structures</li>
<li>Communications tool to facilitate interaction among the designer, the applications programmer, and the end user</li>
<li>Good database model has an appropriate data model at its foundation</li>
<li>End-users have different needs and views for the data</li>
<li>Data model organises data for various users</li>
</ul>
</div>
</div>
