notes/y2/databases.org
** Basic building blocks
   - Entity: is anything about which data is to be collected and stored
   - Attribute: is a characteristic of an entity
   - Relationship: describes an association among (two or more) entities
     - One to many (1:M) relationship
     - Many to many (M:N or M:M) relationship
     - One to one (1:1) relationship

** Evolution of data models
   - Hierarchical
   - Network
   - Relational <- _only these are covered_
   - Entity relationship <- _only these are covered_
   - Object oriented

** Entity Model as in Entity Relationship (ER)
   - An ER model is an abstract way of describing a database.
   - In the case of a relational model, which stores data in tables, some of the data in these tables point to data in other tables - for instance, your entry in the database could point to several entries for each of the phone numbers that are yours.
   - The ER model would say that you are an entity, and each phone number is an entity, and the relationship between you and the phone numbers is *has a phone number*.
   - Diagrams created to design these entities and relationships are called entity–relationship diagrams or ER diagrams

** Conceptual Model
   - Represents global view of the database
   - Enterprie-wide representation of data as viewd by high-level managers
   - Basis for identification and description of main data objects, avoiding details
   - Most widely used conceptual mode is the entity relationship (ER) model
   - Provides a relatively easily understood macro level view of data environment
   - Independent from both software and hardware

** Internal Model
   - Representation od the database as "seen" by the DBMS, the software itself
   - Adapts the Conceptual Model to the DBMS
   - Software dependent
   - Hardware independent

** External Model
   - End users' view of the data environment
   - Requires that the modeler subdivides the set of requirements and constraints into functional modules that can be examined
   - Good design should:
     - Consider such relationships between views
     - Provide programmers with a set of restrictions that govern common entities
   - Use of database subsets makes application program development much simpler
   - Provides feedback about the Conceptual Model's adequacy
   - Creation of external models help to ensure security constraints in the DB design
   - DBMS dependent
   - Hardware independent

** The Physical Model
   - Operates at the lowest level of abstraction, describes the way the data is stored in the hardware
   - Software and Hardware dependent
   - Requires for the DB designers to have the knowledge about the hardware and the software

** Database Users
   - Are either applications or on-line terminal users via query languages

** User languages, Data Sublanguage (DSL)

*** Data Definition Langauge (DDL)
    - Definition and description of database objects by the user. e.g. definition of table, attribute names and values ranges

*** Data Manipulation Language (DML)
    - Provides queries for read / writing and processing of database objects. e.g. inserting, deleting, reading or updating data in the tables

* Relational Database Model

** Relational Model
   - Enables us to view data logically rather than physically
   - Reminds us of simpler file concept of data storage

** Table
   - Has advantages of structural and data independence
   - Resembles a file from conceptual point of view
   - Easier to understand than its hierarchical and network database predecessors

* College access
  - Use ~admin~ as password for college acccess

* Basic queries on databases

** Show all local databases
   #+BEGIN_SRC sql
  SHOW DATABASES;
   #+END_SRC

** Change the current database
   #+BEGIN_SRC sql
   USE some_database;
   #+END_SRC

** Create new database
   #+BEGIN_SRC sql
   CREATE database some_database;
   #+END_SRC

* Basic queries on tables

** Show all tables within the database
   #+BEGIN_SRC sql
  SHOW TABLES FROM some_database;
   #+END_SRC

** Show information about a table
   #+BEGIN_SRC sql
   DESCRIBE some_database.some_table;
   #+END_SRC
   - alternatively use
   #+BEGIN_SRC sql
   SHOW columns some_table;
   #+END_SRC

** Deleting a table
   #+BEGIN_SRC sql
   DROP TABLE table_name;
   #+END_SRC

** Creating a table
   #+BEGIN_SRC sql
CREATE TABEL my_info (
       id INTEGER NOT NULL,
       first_name CHAR (12),
       last_name CHAR (20),
       gender CHAR(1)
);
   #+END_SRC

** Removing a table
   #+BEGIN_SRC sql
   DROP TABLE some_table;
   #+END_SRC

* Inserting data

