notes/y2/databases.html

<div id="outline-container-org21eef50" class="outline-3">
<h3 id="org21eef50"><span class="section-number-3">2.2</span> Basic building blocks</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Entity: is anything about which data is to be collected and stored</li>
<li>Attribute: is a characteristic of an entity</li>
<li>Relationship: describes an association among (two or more) entities
<ul class="org-ul">
<li>One to many (1:M) relationship</li>
<li>Many to many (M:N or M:M) relationship</li>
<li>One to one (1:1) relationship</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org7f0ee88" class="outline-3">
<h3 id="org7f0ee88"><span class="section-number-3">2.3</span> Evolution of data models</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Hierarchical</li>
<li>Network</li>
<li>Relational &lt;- <span class="underline">only these are covered</span></li>
<li>Entity relationship &lt;- <span class="underline">only these are covered</span></li>
<li>Object oriented</li>
</ul>
</div>
</div>

<div id="outline-container-org186db9a" class="outline-3">
<h3 id="org186db9a"><span class="section-number-3">2.4</span> Entity Model as in Entity Relationship (ER)</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>An ER model is an abstract way of describing a database.</li>
<li>In the case of a relational model, which stores data in tables, some of the data in these tables point to data in other tables - for instance, your entry in the database could point to several entries for each of the phone numbers that are yours.</li>
<li>The ER model would say that you are an entity, and each phone number is an entity, and the relationship between you and the phone numbers is <b>has a phone number</b>.</li>
<li>Diagrams created to design these entities and relationships are called entity–relationship diagrams or ER diagrams</li>
</ul>
</div>
</div>

<div id="outline-container-org020944e" class="outline-3">
<h3 id="org020944e"><span class="section-number-3">2.5</span> Conceptual Model</h3>
<div class="outline-text-3" id="text-2-5">
<ul class="org-ul">
<li>Represents global view of the database</li>
<li>Enterprie-wide representation of data as viewd by high-level managers</li>
<li>Basis for identification and description of main data objects, avoiding details</li>
<li>Most widely used conceptual mode is the entity relationship (ER) model</li>
<li>Provides a relatively easily understood macro level view of data environment</li>
<li>Independent from both software and hardware</li>
</ul>
</div>
</div>

<div id="outline-container-org0cc8a31" class="outline-3">
<h3 id="org0cc8a31"><span class="section-number-3">2.6</span> Internal Model</h3>
<div class="outline-text-3" id="text-2-6">
<ul class="org-ul">
<li>Representation od the database as "seen" by the DBMS, the software itself</li>
<li>Adapts the Conceptual Model to the DBMS</li>
<li>Software dependent</li>
<li>Hardware independent</li>
</ul>
</div>
</div>

<div id="outline-container-org822de14" class="outline-3">
<h3 id="org822de14"><span class="section-number-3">2.7</span> External Model</h3>
<div class="outline-text-3" id="text-2-7">
<ul class="org-ul">
<li>End users' view of the data environment</li>
<li>Requires that the modeler subdivides the set of requirements and constraints into functional modules that can be examined</li>
<li>Good design should:
<ul class="org-ul">
<li>Consider such relationships between views</li>
<li>Provide programmers with a set of restrictions that govern common entities</li>
</ul></li>
<li>Use of database subsets makes application program development much simpler</li>
<li>Provides feedback about the Conceptual Model's adequacy</li>
<li>Creation of external models help to ensure security constraints in the DB design</li>
<li>DBMS dependent</li>
<li>Hardware independent</li>
</ul>
</div>
</div>

<div id="outline-container-org6942ae6" class="outline-3">
<h3 id="org6942ae6"><span class="section-number-3">2.8</span> The Physical Model</h3>
<div class="outline-text-3" id="text-2-8">
<ul class="org-ul">
<li>Operates at the lowest level of abstraction, describes the way the data is stored in the hardware</li>
<li>Software and Hardware dependent</li>
<li>Requires for the DB designers to have the knowledge about the hardware and the software</li>
</ul>
</div>
</div>

<div id="outline-container-org32a3047" class="outline-3">
<h3 id="org32a3047"><span class="section-number-3">2.9</span> Database Users</h3>
<div class="outline-text-3" id="text-2-9">
<ul class="org-ul">
<li>Are either applications or on-line terminal users via query languages</li>
</ul>
</div>
</div>

<div id="outline-container-org120848b" class="outline-3">
<h3 id="org120848b"><span class="section-number-3">2.10</span> User languages, Data Sublanguage (DSL)</h3>
<div class="outline-text-3" id="text-2-10">
</div>
<ol class="org-ol">
<li><a id="org65060e9"></a>Data Definition Langauge (DDL)<br />
<div class="outline-text-4" id="text-2-10-1">
<ul class="org-ul">
<li>Definition and description of database objects by the user. e.g. definition of table, attribute names and values ranges</li>
</ul>
</div>
</li>

<li><a id="org0c2a9c7"></a>Data Manipulation Language (DML)<br />
<div class="outline-text-4" id="text-2-10-2">
<ul class="org-ul">
<li>Provides queries for read / writing and processing of database objects. e.g. inserting, deleting, reading or updating data in the tables</li>
</ul>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-orgd0223c5" class="outline-2">
<h2 id="orgd0223c5"><span class="section-number-2">3</span> Relational Database Model</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgc4572ab" class="outline-3">
<h3 id="orgc4572ab"><span class="section-number-3">3.1</span> Relational Model</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Enables us to view data logically rather than physically</li>
<li>Reminds us of simpler file concept of data storage</li>
</ul>
</div>
</div>

<div id="outline-container-orgd0d8e26" class="outline-3">
<h3 id="orgd0d8e26"><span class="section-number-3">3.2</span> Table</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Has advantages of structural and data independence</li>
<li>Resembles a file from conceptual point of view</li>
<li>Easier to understand than its hierarchical and network database predecessors</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org77257fa" class="outline-2">
<h2 id="org77257fa"><span class="section-number-2">4</span> College access</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Use <code>admin</code> as password for college acccess</li>
</ul>
</div>
</div>

<div id="outline-container-orgf376dd0" class="outline-2">
<h2 id="orgf376dd0"><span class="section-number-2">5</span> Basic queries on databases</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgdd9977e" class="outline-3">
<h3 id="orgdd9977e"><span class="section-number-3">5.1</span> Show all local databases</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-sql">SHOW DATABASES;
</pre>
</div>
</div>
</div>

<div id="outline-container-org88b5f2b" class="outline-3">
<h3 id="org88b5f2b"><span class="section-number-3">5.2</span> Change the current database</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">
<pre class="src src-sql">USE some_database;
</pre>
</div>
</div>
</div>

<div id="outline-container-org6bf6b02" class="outline-3">
<h3 id="org6bf6b02"><span class="section-number-3">5.3</span> Create new database</h3>
<div class="outline-text-3" id="text-5-3">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">CREATE</span> database some_database;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org7ef60a2" class="outline-2">
<h2 id="org7ef60a2"><span class="section-number-2">6</span> Basic queries on tables</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org13ede84" class="outline-3">
<h3 id="org13ede84"><span class="section-number-3">6.1</span> Show all tables within the database</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">
<pre class="src src-sql">SHOW TABLES <span style="color: #51afef; font-style: italic;">FROM</span> some_database;
</pre>
</div>
</div>
</div>

<div id="outline-container-org794e75c" class="outline-3">
<h3 id="org794e75c"><span class="section-number-3">6.2</span> Show information about a table</h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">DESCRIBE</span> some_database.some_table;
</pre>
</div>
<ul class="org-ul">
<li>alternatively use</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql">SHOW columns some_table;
</pre>
</div>
</div>
</div>

<div id="outline-container-org45b5d21" class="outline-3">
<h3 id="org45b5d21"><span class="section-number-3">6.3</span> Deleting a table</h3>
<div class="outline-text-3" id="text-6-3">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">DROP</span> <span style="color: #51afef; font-style: italic;">TABLE</span> <span style="color: #51afef; font-style: italic;">table_name</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org197b5e8" class="outline-3">
<h3 id="org197b5e8"><span class="section-number-3">6.4</span> Creating a table</h3>
<div class="outline-text-3" id="text-6-4">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">CREATE</span> TABEL my_info <span style="color: #fff0f5;">(</span>
       id <span style="color: #ECBE7B;">INTEGER</span> <span style="color: #51afef; font-style: italic;">NOT</span> <span style="color: #51afef; font-style: italic;">NULL</span>,
       first_name <span style="color: #ECBE7B;">CHAR</span> <span style="color: #c678dd;">(</span>12<span style="color: #c678dd;">)</span>,
       last_name <span style="color: #ECBE7B;">CHAR</span> <span style="color: #c678dd;">(</span>20<span style="color: #c678dd;">)</span>,
       gender <span style="color: #ECBE7B;">CHAR</span><span style="color: #c678dd;">(</span>1<span style="color: #c678dd;">)</span>
<span style="color: #fff0f5;">)</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org2f09a76" class="outline-3">
<h3 id="org2f09a76"><span class="section-number-3">6.5</span> Removing a table</h3>
<div class="outline-text-3" id="text-6-5">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">DROP</span> <span style="color: #51afef; font-style: italic;">TABLE</span> <span style="color: #c678dd;">some_table</span>;
</pre>
</div>
</div>
</div>
</div>
