notes/y2/databases.org
** Inserting data into the table
   #+BEGIN_SRC sql
INSERT INTO my_info(id, first_name, last_name, gender)
VALUES (1, 'joe', 'blogs', 'M');
   #+END_SRC

   alternatively do not specify the individual columns
   #+BEGIN_SRC sql
INSERT INTO my_info
VALUES (1, 'joe', 'blogs', 'M');
   #+END_SRC

* Deleting data

** Deleting information
   #+BEGIN_SRC sql
   DELETE FROM my_info WHERE gender = 'F';
   #+END_SRC

   mind the slight variation where the column is a ~null~. use ~IS NULL~
   #+BEGIN_SRC sql
   DELETE FROM my_info WHERE gender IS NULL;
   #+END_SRC

   deleting all rows
   #+BEGIN_SRC sql
   DELETE FROM table_name;
   #+END_SRC

* Updating data example
  #+BEGIN_SRC sql
UPDATE customers SET lastname = "Dolan" WHERE cus_id = 1;
  #+END_SRC

* Selecting data

** Select all from a table
   #+BEGIN_SRC sql
   SELECT * FROM some_table;
   #+END_SRC

** Selecting specific columns, aka Projection
   #+BEGIN_SRC sql
   SELECT first_name, last_name FROM some_table;
   #+END_SRC

** Selecting distinct data from columns
   #+BEGIN_SRC sql
   SELECT DISTINCT first_name FROM some_table;
   #+END_SRC

** Selecting specific columns and renaming them
   #+BEGIN_SRC sql
   SELECT first_name AS fName, last_name AS surname FROM my_info;
   #+END_SRC

** Selecting specific columns with a condition
   #+BEGIN_SRC sql
   SELECT first_name, last_name FROM my_info WHERE gender = 'M';
   #+END_SRC

** Selecting data in-between values
   #+BEGIN_SRC sql
   SELECT first_name, last_name FROM my_info WHERE age BETWEEN 30 AND 40;
   #+END_SRC

* Using wildcards
  - the ~percent~ is an any wildcard
  - match all firstNames starting with ~Da~
  #+BEGIN_SRC sql
  SELECT * FROM my_info WHERE firstName LIKE "Da%";
  #+END_SRC

  - match all firstNames ending with ~Da~
  #+BEGIN_SRC sql
  SELECT * FROM my_info WHERE firstName LIKE "%Da";
  #+END_SRC

  - match all firstNames that contain ~Da~
  #+BEGIN_SRC sql
  SELECT * FROM my_info WHERE firstName LIKE "%Da%";
  #+END_SRC

  - match all firstNames that end with second last letter ~e~
  - the ~underscore~ replaces any character
  #+BEGIN_SRC sql
  SELECT * FROM my_info WHERE firstName LIKE "%e_";
  #+END_SRC

* Ordering selected data

** Ordering data
   - ascending order
   #+BEGIN_SRC sql
   SELECT * FROM my_info ORDER BY some_column;
   #+END_SRC

   - descending order
   #+BEGIN_SRC sql
   SELECT * FROM my_info ORDER BY some_column DESC;
   #+END_SRC

   - combining
   #+BEGIN_SRC sql
   SELECT * FROM my_info ORDER BY some_column DESC AND some_other_column ASC;
   #+END_SRC

* Expressions

** Calculation and expressions in the query
   #+BEGIN_SRC sql
   SELECT *, (65 - age) AS yearToRetire FROM details;
   #+END_SRC

* Aggregation functions

** Count
   #+BEGIN_SRC sql
   SELECT COUNT(*) FROM details;
   #+END_SRC

** Max
   #+BEGIN_SRC sql
   SELECT MAX(age) as averageAge FROM details;
   #+END_SRC

