notes/y2/databases.html

<div id="outline-container-org1a99372" class="outline-2">
<h2 id="org1a99372"><span class="section-number-2">7</span> Inserting data</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgb1a93e0" class="outline-3">
<h3 id="orgb1a93e0"><span class="section-number-3">7.1</span> Inserting data into the table</h3>
<div class="outline-text-3" id="text-7-1">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">INSERT</span> <span style="color: #51afef; font-style: italic;">INTO</span> my_info<span style="color: #fff0f5;">(</span>id, first_name, last_name, gender<span style="color: #fff0f5;">)</span>
<span style="color: #51afef; font-style: italic;">VALUES</span> <span style="color: #fff0f5;">(</span>1, <span style="color: #98be65;">'joe'</span>, <span style="color: #98be65;">'blogs'</span>, <span style="color: #98be65;">'M'</span><span style="color: #fff0f5;">)</span>;
</pre>
</div>

<p>
alternatively do not specify the individual columns
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">INSERT</span> <span style="color: #51afef; font-style: italic;">INTO</span> my_info
<span style="color: #51afef; font-style: italic;">VALUES</span> <span style="color: #fff0f5;">(</span>1, <span style="color: #98be65;">'joe'</span>, <span style="color: #98be65;">'blogs'</span>, <span style="color: #98be65;">'M'</span><span style="color: #fff0f5;">)</span>;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4d56124" class="outline-2">
<h2 id="org4d56124"><span class="section-number-2">8</span> Deleting data</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orgb44f040" class="outline-3">
<h3 id="orgb44f040"><span class="section-number-3">8.1</span> Deleting information</h3>
<div class="outline-text-3" id="text-8-1">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">DELETE</span> <span style="color: #51afef; font-style: italic;">FROM</span> my_info <span style="color: #51afef; font-style: italic;">WHERE</span> gender = <span style="color: #98be65;">'F'</span>;
</pre>
</div>

<p>
mind the slight variation where the column is a <code>null</code>. use <code>IS NULL</code>
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">DELETE</span> <span style="color: #51afef; font-style: italic;">FROM</span> my_info <span style="color: #51afef; font-style: italic;">WHERE</span> gender <span style="color: #51afef; font-style: italic;">IS</span> <span style="color: #51afef; font-style: italic;">NULL</span>;
</pre>
</div>

<p>
deleting all rows
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">DELETE</span> <span style="color: #51afef; font-style: italic;">FROM</span> <span style="color: #51afef; font-style: italic;">table_name</span>;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8c62035" class="outline-2">
<h2 id="org8c62035"><span class="section-number-2">9</span> Updating data example</h2>
<div class="outline-text-2" id="text-9">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">UPDATE</span> customers <span style="color: #51afef; font-style: italic;">SET</span> lastname = "Dolan" <span style="color: #51afef; font-style: italic;">WHERE</span> cus_id = 1;
</pre>
</div>
</div>
</div>

<div id="outline-container-org14983da" class="outline-2">
<h2 id="org14983da"><span class="section-number-2">10</span> Selecting data</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-orgb553809" class="outline-3">
<h3 id="orgb553809"><span class="section-number-3">10.1</span> Select all from a table</h3>
<div class="outline-text-3" id="text-10-1">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">SELECT</span> * <span style="color: #51afef; font-style: italic;">FROM</span> some_table;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb81d553" class="outline-3">
<h3 id="orgb81d553"><span class="section-number-3">10.2</span> Selecting specific columns, aka Projection</h3>
<div class="outline-text-3" id="text-10-2">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">SELECT</span> first_name, last_name <span style="color: #51afef; font-style: italic;">FROM</span> some_table;
</pre>
</div>
</div>
</div>

<div id="outline-container-org6b58257" class="outline-3">
<h3 id="org6b58257"><span class="section-number-3">10.3</span> Selecting distinct data from columns</h3>
<div class="outline-text-3" id="text-10-3">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">SELECT</span> <span style="color: #51afef; font-style: italic;">DISTINCT</span> first_name <span style="color: #51afef; font-style: italic;">FROM</span> some_table;
</pre>
</div>
</div>
</div>

<div id="outline-container-org8226e1d" class="outline-3">
<h3 id="org8226e1d"><span class="section-number-3">10.4</span> Selecting specific columns and renaming them</h3>
<div class="outline-text-3" id="text-10-4">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">SELECT</span> first_name <span style="color: #51afef; font-style: italic;">AS</span> fName, last_name <span style="color: #51afef; font-style: italic;">AS</span> surname <span style="color: #51afef; font-style: italic;">FROM</span> my_info;
</pre>
</div>
</div>
</div>

<div id="outline-container-org0a6650d" class="outline-3">
<h3 id="org0a6650d"><span class="section-number-3">10.5</span> Selecting specific columns with a condition</h3>
<div class="outline-text-3" id="text-10-5">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">SELECT</span> first_name, last_name <span style="color: #51afef; font-style: italic;">FROM</span> my_info <span style="color: #51afef; font-style: italic;">WHERE</span> gender = <span style="color: #98be65;">'M'</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org82597c8" class="outline-3">
<h3 id="org82597c8"><span class="section-number-3">10.6</span> Selecting data in-between values</h3>
<div class="outline-text-3" id="text-10-6">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">SELECT</span> first_name, last_name <span style="color: #51afef; font-style: italic;">FROM</span> my_info <span style="color: #51afef; font-style: italic;">WHERE</span> age <span style="color: #51afef; font-style: italic;">BETWEEN</span> 30 <span style="color: #51afef; font-style: italic;">AND</span> 40;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgeed31c9" class="outline-2">
<h2 id="orgeed31c9"><span class="section-number-2">11</span> Using wildcards</h2>
<div class="outline-text-2" id="text-11">
<ul class="org-ul">
<li>the <code>percent</code> is an any wildcard</li>
<li>match all firstNames starting with <code>Da</code></li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">SELECT</span> * <span style="color: #51afef; font-style: italic;">FROM</span> my_info <span style="color: #51afef; font-style: italic;">WHERE</span> firstName <span style="color: #51afef; font-style: italic;">LIKE</span> "Da%";
</pre>
</div>

<ul class="org-ul">
<li>match all firstNames ending with <code>Da</code></li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">SELECT</span> * <span style="color: #51afef; font-style: italic;">FROM</span> my_info <span style="color: #51afef; font-style: italic;">WHERE</span> firstName <span style="color: #51afef; font-style: italic;">LIKE</span> "%Da";
</pre>
</div>

<ul class="org-ul">
<li>match all firstNames that contain <code>Da</code></li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">SELECT</span> * <span style="color: #51afef; font-style: italic;">FROM</span> my_info <span style="color: #51afef; font-style: italic;">WHERE</span> firstName <span style="color: #51afef; font-style: italic;">LIKE</span> "%Da%";
</pre>
</div>

<ul class="org-ul">
<li>match all firstNames that end with second last letter <code>e</code></li>
<li>the <code>underscore</code> replaces any character</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">SELECT</span> * <span style="color: #51afef; font-style: italic;">FROM</span> my_info <span style="color: #51afef; font-style: italic;">WHERE</span> firstName <span style="color: #51afef; font-style: italic;">LIKE</span> "%e_";
</pre>
</div>
</div>
</div>

<div id="outline-container-org01195c2" class="outline-2">
<h2 id="org01195c2"><span class="section-number-2">12</span> Ordering selected data</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-org2c64777" class="outline-3">
<h3 id="org2c64777"><span class="section-number-3">12.1</span> Ordering data</h3>
<div class="outline-text-3" id="text-12-1">
<ul class="org-ul">
<li>ascending order</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">SELECT</span> * <span style="color: #51afef; font-style: italic;">FROM</span> my_info <span style="color: #51afef; font-style: italic;">ORDER</span> <span style="color: #51afef; font-style: italic;">BY</span> some_column;
</pre>
</div>

<ul class="org-ul">
<li>descending order</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">SELECT</span> * <span style="color: #51afef; font-style: italic;">FROM</span> my_info <span style="color: #51afef; font-style: italic;">ORDER</span> <span style="color: #51afef; font-style: italic;">BY</span> some_column <span style="color: #51afef; font-style: italic;">DESC</span>;
</pre>
</div>

<ul class="org-ul">
<li>combining</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">SELECT</span> * <span style="color: #51afef; font-style: italic;">FROM</span> my_info <span style="color: #51afef; font-style: italic;">ORDER</span> <span style="color: #51afef; font-style: italic;">BY</span> some_column <span style="color: #51afef; font-style: italic;">DESC</span> <span style="color: #51afef; font-style: italic;">AND</span> some_other_column <span style="color: #51afef; font-style: italic;">ASC</span>;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org13dc213" class="outline-2">
<h2 id="org13dc213"><span class="section-number-2">13</span> Expressions</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-org1b6fb34" class="outline-3">
<h3 id="org1b6fb34"><span class="section-number-3">13.1</span> Calculation and expressions in the query</h3>
<div class="outline-text-3" id="text-13-1">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">SELECT</span> *, <span style="color: #fff0f5;">(</span>65 - age<span style="color: #fff0f5;">)</span> <span style="color: #51afef; font-style: italic;">AS</span> yearToRetire <span style="color: #51afef; font-style: italic;">FROM</span> details;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org045edc4" class="outline-2">
<h2 id="org045edc4"><span class="section-number-2">14</span> Aggregation functions</h2>
<div class="outline-text-2" id="text-14">
</div>
<div id="outline-container-orga62a0af" class="outline-3">
<h3 id="orga62a0af"><span class="section-number-3">14.1</span> Count</h3>
<div class="outline-text-3" id="text-14-1">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">SELECT</span> <span style="color: #c678dd;">COUNT</span><span style="color: #fff0f5;">(</span>*<span style="color: #fff0f5;">)</span> <span style="color: #51afef; font-style: italic;">FROM</span> details;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf845cea" class="outline-3">
<h3 id="orgf845cea"><span class="section-number-3">14.2</span> Max</h3>
<div class="outline-text-3" id="text-14-2">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">SELECT</span> <span style="color: #c678dd;">MAX</span><span style="color: #fff0f5;">(</span>age<span style="color: #fff0f5;">)</span> <span style="color: #51afef; font-style: italic;">as</span> averageAge <span style="color: #51afef; font-style: italic;">FROM</span> details;
</pre>
</div>
</div>
</div>
