notes/y2/databases.org
** Min
   #+BEGIN_SRC sql
   SELECT MIN(age) as averageAge FROM details;
   #+END_SRC

** Average
   #+BEGIN_SRC sql
   SELECT AVG(age) as averageAge FROM details;
   #+END_SRC

** Sum
   #+BEGIN_SRC sql
   SELECT SUM(age) as averageAge FROM details;
   #+END_SRC

* Having clause
  #+BEGIN_SRC sql
SELECT department, COUNT(*) AS employees
FROM details
GROUP BY department HAVING COUNT(*) > 3;
  #+END_SRC

* Limit clause
  - ascending
  #+BEGIN_SRC sql
  SELECT * FROM details LIMIT 5;
  #+END_SRC
  -descending
  #+BEGIN_SRC sql
  SELECT * FROM details ORDER BY id DESC LIMIT 5;
  #+END_SRC
  - offset
  #+BEGIN_SRC sql
  SELECT * FROM details LIMIT 5 OFFSET 15;
  #+END_SRC

* Subqueries
  #+BEGIN_SRC sql
SELECT *
FROM details
WHERE age > (SELECT AVG(age) FROM details);
  #+END_SRC

* Complex queries

** Union example (both need to have the same column count)
   #+BEGIN_SRC sql
(select firstName, lastName, town from customers)
UNION
(select firstName, lastName, town from employees);
   #+END_SRC

** Inner join (intersection)
   - with shorthands
   #+BEGIN_SRC sql
select c.firstName, c.lastName, c.town
from customers as c
inner join employees as e
on c.firstName = e.firstName
and c.lastName = e.lastName
and c.town = e.town;
   #+END_SRC
   - without shorthands
   #+BEGIN_SRC sql
select customer.firstName, customer.lastName, customer.town
from customers
inner join employees
on customer.firstName = employees.firstName
and customer.lastName = employees.lastName
and customer.town = employees.town;
   #+END_SRC

   - with an ~EXISTS~ keyword
   #+BEGIN_SRC sql
select c.firstName, c.lastName, c.town
from customers as c
where exists
(select e.firstName, e.lastName, e.town
from employees as e
where c.firstName = e.firstName
and c.lastName = e.lastName
and c.town = e.town);
   #+END_SRC

** Except (~NOT EXISTS~), basically set A - B
   #+BEGIN_SRC sql
select c.firstName, c.lastName, c.town
from customers as c
where not exists
(select e.firstName, e.lastName, e.town
from employees as e
where c.firstName = e.firstName
and c.lastName = e.lastName
and c.town = e.town);
   #+END_SRC

** Division
   #+BEGIN_SRC sql
select distinct c1.y as y from c c1
where not exists
(select d.x
from d
where d.x not in
(select c2.x
from c c2
where c2.y = c1.y));
   #+END_SRC

