notes/y2/databases.html

<div id="outline-container-orgfde02d3" class="outline-3">
<h3 id="orgfde02d3"><span class="section-number-3">14.3</span> Min</h3>
<div class="outline-text-3" id="text-14-3">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">SELECT</span> <span style="color: #c678dd;">MIN</span><span style="color: #fff0f5;">(</span>age<span style="color: #fff0f5;">)</span> <span style="color: #51afef; font-style: italic;">as</span> averageAge <span style="color: #51afef; font-style: italic;">FROM</span> details;
</pre>
</div>
</div>
</div>

<div id="outline-container-org37335bc" class="outline-3">
<h3 id="org37335bc"><span class="section-number-3">14.4</span> Average</h3>
<div class="outline-text-3" id="text-14-4">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">SELECT</span> <span style="color: #c678dd;">AVG</span><span style="color: #fff0f5;">(</span>age<span style="color: #fff0f5;">)</span> <span style="color: #51afef; font-style: italic;">as</span> averageAge <span style="color: #51afef; font-style: italic;">FROM</span> details;
</pre>
</div>
</div>
</div>

<div id="outline-container-org3d0b3fe" class="outline-3">
<h3 id="org3d0b3fe"><span class="section-number-3">14.5</span> Sum</h3>
<div class="outline-text-3" id="text-14-5">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">SELECT</span> <span style="color: #c678dd;">SUM</span><span style="color: #fff0f5;">(</span>age<span style="color: #fff0f5;">)</span> <span style="color: #51afef; font-style: italic;">as</span> averageAge <span style="color: #51afef; font-style: italic;">FROM</span> details;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org38777f0" class="outline-2">
<h2 id="org38777f0"><span class="section-number-2">15</span> Having clause</h2>
<div class="outline-text-2" id="text-15">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">SELECT</span> department, <span style="color: #c678dd;">COUNT</span><span style="color: #fff0f5;">(</span>*<span style="color: #fff0f5;">)</span> <span style="color: #51afef; font-style: italic;">AS</span> employees
<span style="color: #51afef; font-style: italic;">FROM</span> details
<span style="color: #51afef; font-style: italic;">GROUP</span> <span style="color: #51afef; font-style: italic;">BY</span> department <span style="color: #51afef; font-style: italic;">HAVING</span> <span style="color: #c678dd;">COUNT</span><span style="color: #fff0f5;">(</span>*<span style="color: #fff0f5;">)</span> &gt; 3;
</pre>
</div>
</div>
</div>

<div id="outline-container-org74c7077" class="outline-2">
<h2 id="org74c7077"><span class="section-number-2">16</span> Limit clause</h2>
<div class="outline-text-2" id="text-16">
<ul class="org-ul">
<li>ascending</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">SELECT</span> * <span style="color: #51afef; font-style: italic;">FROM</span> details <span style="color: #51afef; font-style: italic;">LIMIT</span> 5;
</pre>
</div>
<p>
-descending
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">SELECT</span> * <span style="color: #51afef; font-style: italic;">FROM</span> details <span style="color: #51afef; font-style: italic;">ORDER</span> <span style="color: #51afef; font-style: italic;">BY</span> id <span style="color: #51afef; font-style: italic;">DESC</span> <span style="color: #51afef; font-style: italic;">LIMIT</span> 5;
</pre>
</div>
<ul class="org-ul">
<li>offset</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">SELECT</span> * <span style="color: #51afef; font-style: italic;">FROM</span> details <span style="color: #51afef; font-style: italic;">LIMIT</span> 5 OFFSET 15;
</pre>
</div>
</div>
</div>

<div id="outline-container-org2dff419" class="outline-2">
<h2 id="org2dff419"><span class="section-number-2">17</span> Subqueries</h2>
<div class="outline-text-2" id="text-17">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">SELECT</span> *
<span style="color: #51afef; font-style: italic;">FROM</span> details
<span style="color: #51afef; font-style: italic;">WHERE</span> age &gt; <span style="color: #fff0f5;">(</span><span style="color: #51afef; font-style: italic;">SELECT</span> <span style="color: #c678dd;">AVG</span><span style="color: #c678dd;">(</span>age<span style="color: #c678dd;">)</span> <span style="color: #51afef; font-style: italic;">FROM</span> details<span style="color: #fff0f5;">)</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf3f1478" class="outline-2">
<h2 id="orgf3f1478"><span class="section-number-2">18</span> Complex queries</h2>
<div class="outline-text-2" id="text-18">
</div>
<div id="outline-container-orgc6d8abd" class="outline-3">
<h3 id="orgc6d8abd"><span class="section-number-3">18.1</span> Union example (both need to have the same column count)</h3>
<div class="outline-text-3" id="text-18-1">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #fff0f5;">(</span><span style="color: #51afef; font-style: italic;">select</span> firstName, lastName, town <span style="color: #51afef; font-style: italic;">from</span> customers<span style="color: #fff0f5;">)</span>
<span style="color: #51afef; font-style: italic;">UNION</span>
<span style="color: #fff0f5;">(</span><span style="color: #51afef; font-style: italic;">select</span> firstName, lastName, town <span style="color: #51afef; font-style: italic;">from</span> employees<span style="color: #fff0f5;">)</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org95cf2bf" class="outline-3">
<h3 id="org95cf2bf"><span class="section-number-3">18.2</span> Inner join (intersection)</h3>
<div class="outline-text-3" id="text-18-2">
<ul class="org-ul">
<li>with shorthands</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">select</span> c.firstName, c.lastName, c.town
<span style="color: #51afef; font-style: italic;">from</span> customers <span style="color: #51afef; font-style: italic;">as</span> c
<span style="color: #51afef; font-style: italic;">inner</span> <span style="color: #51afef; font-style: italic;">join</span> employees <span style="color: #51afef; font-style: italic;">as</span> e
<span style="color: #51afef; font-style: italic;">on</span> c.firstName = e.firstName
<span style="color: #51afef; font-style: italic;">and</span> c.lastName = e.lastName
<span style="color: #51afef; font-style: italic;">and</span> c.town = e.town;
</pre>
</div>
<ul class="org-ul">
<li>without shorthands</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">select</span> customer.firstName, customer.lastName, customer.town
<span style="color: #51afef; font-style: italic;">from</span> customers
<span style="color: #51afef; font-style: italic;">inner</span> <span style="color: #51afef; font-style: italic;">join</span> employees
<span style="color: #51afef; font-style: italic;">on</span> customer.firstName = employees.firstName
<span style="color: #51afef; font-style: italic;">and</span> customer.lastName = employees.lastName
<span style="color: #51afef; font-style: italic;">and</span> customer.town = employees.town;
</pre>
</div>

<ul class="org-ul">
<li>with an <code>EXISTS</code> keyword</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">select</span> c.firstName, c.lastName, c.town
<span style="color: #51afef; font-style: italic;">from</span> customers <span style="color: #51afef; font-style: italic;">as</span> c
<span style="color: #51afef; font-style: italic;">where</span> <span style="color: #51afef; font-style: italic;">exists</span>
<span style="color: #fff0f5;">(</span><span style="color: #51afef; font-style: italic;">select</span> e.firstName, e.lastName, e.town
<span style="color: #51afef; font-style: italic;">from</span> employees <span style="color: #51afef; font-style: italic;">as</span> e
<span style="color: #51afef; font-style: italic;">where</span> c.firstName = e.firstName
<span style="color: #51afef; font-style: italic;">and</span> c.lastName = e.lastName
<span style="color: #51afef; font-style: italic;">and</span> c.town = e.town<span style="color: #fff0f5;">)</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org1dd2524" class="outline-3">
<h3 id="org1dd2524"><span class="section-number-3">18.3</span> Except (<code>NOT EXISTS</code>), basically set A - B</h3>
<div class="outline-text-3" id="text-18-3">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">select</span> c.firstName, c.lastName, c.town
<span style="color: #51afef; font-style: italic;">from</span> customers <span style="color: #51afef; font-style: italic;">as</span> c
<span style="color: #51afef; font-style: italic;">where</span> <span style="color: #51afef; font-style: italic;">not</span> <span style="color: #51afef; font-style: italic;">exists</span>
<span style="color: #fff0f5;">(</span><span style="color: #51afef; font-style: italic;">select</span> e.firstName, e.lastName, e.town
<span style="color: #51afef; font-style: italic;">from</span> employees <span style="color: #51afef; font-style: italic;">as</span> e
<span style="color: #51afef; font-style: italic;">where</span> c.firstName = e.firstName
<span style="color: #51afef; font-style: italic;">and</span> c.lastName = e.lastName
<span style="color: #51afef; font-style: italic;">and</span> c.town = e.town<span style="color: #fff0f5;">)</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org6501c52" class="outline-3">
<h3 id="org6501c52"><span class="section-number-3">18.4</span> Division</h3>
<div class="outline-text-3" id="text-18-4">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">select</span> <span style="color: #51afef; font-style: italic;">distinct</span> c1.y <span style="color: #51afef; font-style: italic;">as</span> y <span style="color: #51afef; font-style: italic;">from</span> c c1
<span style="color: #51afef; font-style: italic;">where</span> <span style="color: #51afef; font-style: italic;">not</span> <span style="color: #51afef; font-style: italic;">exists</span>
<span style="color: #fff0f5;">(</span><span style="color: #51afef; font-style: italic;">select</span> d.x
<span style="color: #51afef; font-style: italic;">from</span> d
<span style="color: #51afef; font-style: italic;">where</span> d.x <span style="color: #51afef; font-style: italic;">not</span> <span style="color: #51afef; font-style: italic;">in</span>
<span style="color: #c678dd;">(</span><span style="color: #51afef; font-style: italic;">select</span> c2.x
<span style="color: #51afef; font-style: italic;">from</span> c c2
<span style="color: #51afef; font-style: italic;">where</span> c2.y = c1.y<span style="color: #c678dd;">)</span><span style="color: #fff0f5;">)</span>;
</pre>
</div>
</div>
</div>
</div>
