notes/y2/databases.org
* Time and Date functions
  - current date
  #+BEGIN_SRC sql
  select current_date();
  #+END_SRC

  - current date and time
  #+BEGIN_SRC sql
  select now();
  #+END_SRC

  - day name
  #+BEGIN_SRC sql
  select dayname(now());
  #+END_SRC

  - month name
  #+BEGIN_SRC sql
  select monthname(now());
  #+END_SRC

  - numeric values of days, months, years
  #+BEGIN_SRC sql
  select day(now()), month(now()), year(now())
  #+END_SRC

  - also available are day of month(same as ~day()~), day of week and day of year
  #+BEGIN_SRC sql
  select dayofmonth(now()), dayofweek(now()), dayofyear(now())
  #+END_SRC

  - ~date_add~ adds a specific interval(amount of time) to the passed in date
  #+BEGIN_SRC sql
  select now(), date_add(now(), interval 4 day);
  select now(), date_add(now(), interval 5 month);
  select now(), date_add(now(), interval 1 year);
  #+END_SRC

  - ~date_sub~ subtracts a specific interval(amount of time) from the passed in date
  #+BEGIN_SRC sql
  select now(), date_sub(now(), interval 4 day);
  select now(), date_sub(now(), interval 5 month);
  select now(), date_sub(now(), interval 1 year);
  #+END_SRC

  - difference between two dates (in days) is done with ~datediff~
  #+BEGIN_SRC sql
  select datediff(now(), "2017-05-17");
  #+END_SRC

  - days alive
  #+BEGIN_SRC sql
  select datediff(now(), "1983-09-17");
  #+END_SRC

  - formatting the output with ~date_format~
  #+BEGIN_SRC sql
  select date_format(now(), '%y') as year;
  #+END_SRC

* Random numbers
  - random int from 0 to 10
  #+BEGIN_SRC sql
  select cast( (rand() * 10) as unsigned integer);
  #+END_SRC

