notes/y2/databases.html

<div id="outline-container-org9527040" class="outline-2">
<h2 id="org9527040"><span class="section-number-2">19</span> Time and Date functions</h2>
<div class="outline-text-2" id="text-19">
<ul class="org-ul">
<li>current date</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">select</span> <span style="color: #c678dd;">current_date</span><span style="color: #fff0f5;">()</span>;
</pre>
</div>

<ul class="org-ul">
<li>current date and time</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">select</span> now<span style="color: #fff0f5;">()</span>;
</pre>
</div>

<ul class="org-ul">
<li>day name</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">select</span> dayname<span style="color: #fff0f5;">(</span>now<span style="color: #c678dd;">()</span><span style="color: #fff0f5;">)</span>;
</pre>
</div>

<ul class="org-ul">
<li>month name</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">select</span> monthname<span style="color: #fff0f5;">(</span>now<span style="color: #c678dd;">()</span><span style="color: #fff0f5;">)</span>;
</pre>
</div>

<ul class="org-ul">
<li>numeric values of days, months, years</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">select</span> <span style="color: #51afef; font-style: italic;">day</span><span style="color: #fff0f5;">(</span>now<span style="color: #c678dd;">()</span><span style="color: #fff0f5;">)</span>, <span style="color: #51afef; font-style: italic;">month</span><span style="color: #fff0f5;">(</span>now<span style="color: #c678dd;">()</span><span style="color: #fff0f5;">)</span>, <span style="color: #51afef; font-style: italic;">year</span><span style="color: #fff0f5;">(</span>now<span style="color: #c678dd;">()</span><span style="color: #fff0f5;">)</span>
</pre>
</div>

<ul class="org-ul">
<li>also available are day of month(same as <code>day()</code>), day of week and day of year</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">select</span> dayofmonth<span style="color: #fff0f5;">(</span>now<span style="color: #c678dd;">()</span><span style="color: #fff0f5;">)</span>, dayofweek<span style="color: #fff0f5;">(</span>now<span style="color: #c678dd;">()</span><span style="color: #fff0f5;">)</span>, dayofyear<span style="color: #fff0f5;">(</span>now<span style="color: #c678dd;">()</span><span style="color: #fff0f5;">)</span>
</pre>
</div>

<ul class="org-ul">
<li><code>date_add</code> adds a specific interval(amount of time) to the passed in date</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">select</span> now<span style="color: #fff0f5;">()</span>, date_add<span style="color: #fff0f5;">(</span>now<span style="color: #c678dd;">()</span>, <span style="color: #ECBE7B;">interval</span> 4 <span style="color: #51afef; font-style: italic;">day</span><span style="color: #fff0f5;">)</span>;
<span style="color: #51afef; font-style: italic;">select</span> now<span style="color: #fff0f5;">()</span>, date_add<span style="color: #fff0f5;">(</span>now<span style="color: #c678dd;">()</span>, <span style="color: #ECBE7B;">interval</span> 5 <span style="color: #51afef; font-style: italic;">month</span><span style="color: #fff0f5;">)</span>;
<span style="color: #51afef; font-style: italic;">select</span> now<span style="color: #fff0f5;">()</span>, date_add<span style="color: #fff0f5;">(</span>now<span style="color: #c678dd;">()</span>, <span style="color: #ECBE7B;">interval</span> 1 <span style="color: #51afef; font-style: italic;">year</span><span style="color: #fff0f5;">)</span>;
</pre>
</div>

<ul class="org-ul">
<li><code>date_sub</code> subtracts a specific interval(amount of time) from the passed in date</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">select</span> now<span style="color: #fff0f5;">()</span>, date_sub<span style="color: #fff0f5;">(</span>now<span style="color: #c678dd;">()</span>, <span style="color: #ECBE7B;">interval</span> 4 <span style="color: #51afef; font-style: italic;">day</span><span style="color: #fff0f5;">)</span>;
<span style="color: #51afef; font-style: italic;">select</span> now<span style="color: #fff0f5;">()</span>, date_sub<span style="color: #fff0f5;">(</span>now<span style="color: #c678dd;">()</span>, <span style="color: #ECBE7B;">interval</span> 5 <span style="color: #51afef; font-style: italic;">month</span><span style="color: #fff0f5;">)</span>;
<span style="color: #51afef; font-style: italic;">select</span> now<span style="color: #fff0f5;">()</span>, date_sub<span style="color: #fff0f5;">(</span>now<span style="color: #c678dd;">()</span>, <span style="color: #ECBE7B;">interval</span> 1 <span style="color: #51afef; font-style: italic;">year</span><span style="color: #fff0f5;">)</span>;
</pre>
</div>

<ul class="org-ul">
<li>difference between two dates (in days) is done with <code>datediff</code></li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">select</span> datediff<span style="color: #fff0f5;">(</span>now<span style="color: #c678dd;">()</span>, "2017-05-17"<span style="color: #fff0f5;">)</span>;
</pre>
</div>

<ul class="org-ul">
<li>days alive</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">select</span> datediff<span style="color: #fff0f5;">(</span>now<span style="color: #c678dd;">()</span>, "1983-09-17"<span style="color: #fff0f5;">)</span>;
</pre>
</div>

<ul class="org-ul">
<li>formatting the output with <code>date_format</code></li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">select</span> date_format<span style="color: #fff0f5;">(</span>now<span style="color: #c678dd;">()</span>, <span style="color: #98be65;">'%y'</span><span style="color: #fff0f5;">)</span> <span style="color: #51afef; font-style: italic;">as</span> <span style="color: #51afef; font-style: italic;">year</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org1bdc738" class="outline-2">
<h2 id="org1bdc738"><span class="section-number-2">20</span> Random numbers</h2>
<div class="outline-text-2" id="text-20">
<ul class="org-ul">
<li>random int from 0 to 10</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">select</span> <span style="color: #c678dd;">cast</span><span style="color: #fff0f5;">(</span> <span style="color: #c678dd;">(</span>rand<span style="color: #98be65;">()</span> * 10<span style="color: #c678dd;">)</span> <span style="color: #51afef; font-style: italic;">as</span> unsigned <span style="color: #ECBE7B;">integer</span><span style="color: #fff0f5;">)</span>;
</pre>
</div>
</div>
</div>
