notes/y2/databases.org
* Sample DVD DB questions
  - select oldest employee
  #+BEGIN_SRC sql
select firstname, lastname, dateofbirth
from employees
order by dateofbirth
limit 1;

select firstname, lastname, dateofbirth
from employees
where (select min(dateofbirth) from employess);
  #+END_SRC

  - oldest employees
  #+BEGIN_SRC sql
  select *, datediff(now(), dateofbirth) as doba from employees;
  #+END_SRC

  - name of the most rented product
  #+BEGIN_SRC sql
select products.prod_id, name, count(*) as total
from products, rentals
where products.prod_id = rentals.prod_id
group by name
order by total desc
limit 1;
  #+END_SRC

  - who is the best customer
  #+BEGIN_SRC sql
select customers.cus_id, firstname, lastname, count(*) as total
from rentals, customers
where customers.cus_id = rentals.cus_id
group by cus_id
order by total desc
limit 1;
  #+END_SRC

  - top rentals per genre
  #+BEGIN_SRC sql
(select products.prod_id, name, count(*) as total, genre
from products, rentals
where products.prod_id = rentals.prod_id
and genre = "Science Fiction"
group by prod_id
order by total desc
limit 1)
UNION
(select products.prod_id, name, count(*) as total, genre
from products, rentals
where products.prod_id = rentals.prod_id
and genre = "Drama"
group by prod_id
order by total desc
limit 1)
UNION
(select products.prod_id, name, count(*) as total, genre
from products, rentals
where products.prod_id = rentals.prod_id
and genre = "Comedy"
group by prod_id
order by total desc
limit 1);
  #+END_SRC

  - which product was rented first
  #+BEGIN_SRC sql
select name, dateRented
from rentals, products
where rentals.prod_id = products.prod_id
order by daterented
limit 1;
  #+END_SRC

  - which product was never rented
  #+BEGIN_SRC sql
select name
from products
where prod_id
not in
(select distinct prod_id from rentals);
  #+END_SRC

  - top 3 rentals in september 2010
  #+BEGIN_SRC sql
select products.prod_id, name, count(*) as total
from products, rentals
where products.prod_id = rentals.prod_id
and monthname(rentals.daterented) = "September"
and year(rentals.daterented) = 2010
group by name
order by total desc
limit 3;
  #+END_SRC
  - list the products that the customers haven't rented
  #+BEGIN_SRC sql
select name, firstname, lastname
from customers c, products p
where not exists
(select distinct name, firstname, lastname
from rentals, products p1, customers c1
where rentals.prod_id = p1.prod_id
and rentals.cus_id = c1.cus_id
and p.name = p1.name
and c.firstname = c1.firstname
and c.lastname = c1.lastname);
  #+END_SRC

  - pretty print table
  #+BEGIN_SRC sql
select rentals.rental_id,
name,
customers.firstname as cfName,
customers.lastname clName,
employees.firstname as efName,
employees.lastname as elName,
date_format(rentals.daterented, "%W %M %e %Y") as "Date Rented"
from rentals, products, employees, customers
where rentals.prod_id = products.prod_id
and rentals.cus_id = customers.cus_id
and rentals.emp_id = employees.emp_id
order by rental_id;
  #+END_SRC
  - can customer 'Carey' rent out a film for 21s?
  - first: the age of all customers
  #+BEGIN_SRC sql
select firstname, lastname, dateofbirth,
date_format(from_days(datediff(now(), dateofbirth)), '%y') as age
from customers;
  #+END_SRC
  - second: customers who can rent a 21s film
  #+BEGIN_SRC sql
select firstname, lastname, dateofbirth,
date_format(from_days(datediff(now(), dateofbirth)), '%y') as age
from customers
where date_format(from_days(datediff(now(), dateofbirth)), '%y') >= 21;
  #+END_SRC
  - third: customers who cannot rent a 21s film
  #+BEGIN_SRC sql
select firstname, lastname, dateofbirth,
date_format(from_days(datediff(now(), dateofbirth)), '%y') as age
from customers
where date_format(from_days(datediff(now(), dateofbirth)), '%y') < 21;
  #+END_SRC
  - who is the worst employee
  #+BEGIN_SRC sql
select firstname, lastname,
employees.emp_id as emp_id,
count(*) as total
from employees, rentals
where rentals.emp_id = employees.emp_id
group by employees.emp_id
order by total;
  #+END_SRC
  - calculate the sales of dvd (5eur) and blurays (6eur) in september
  #+BEGIN_SRC sql
select 5 * dvd.total + 6 * blu.total as total
from (select format, count(*) as total
from products, rentals
where products.prod_id = rentals.prod_id
and year(daterented) = 2010 and month(daterented) = 9
and format = 'DVD') as dvd,
(select format, count(*) as total
from products, rentals
where products.prod_id = rentals.prod_id
and year(daterented) = 2010 and month(daterented) = 9
and format = 'Blu-ray') as blu;
  #+END_SRC

