notes/y2/databases.html

<div id="outline-container-orgc27180a" class="outline-2">
<h2 id="orgc27180a"><span class="section-number-2">21</span> Sample DVD DB questions</h2>
<div class="outline-text-2" id="text-21">
<ul class="org-ul">
<li>select oldest employee</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">select</span> firstname, lastname, dateofbirth
<span style="color: #51afef; font-style: italic;">from</span> employees
<span style="color: #51afef; font-style: italic;">order</span> <span style="color: #51afef; font-style: italic;">by</span> dateofbirth
<span style="color: #51afef; font-style: italic;">limit</span> 1;

<span style="color: #51afef; font-style: italic;">select</span> firstname, lastname, dateofbirth
<span style="color: #51afef; font-style: italic;">from</span> employees
<span style="color: #51afef; font-style: italic;">where</span> <span style="color: #fff0f5;">(</span><span style="color: #51afef; font-style: italic;">select</span> <span style="color: #c678dd;">min</span><span style="color: #c678dd;">(</span>dateofbirth<span style="color: #c678dd;">)</span> <span style="color: #51afef; font-style: italic;">from</span> employess<span style="color: #fff0f5;">)</span>;
</pre>
</div>

<ul class="org-ul">
<li>oldest employees</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">select</span> *, datediff<span style="color: #fff0f5;">(</span>now<span style="color: #c678dd;">()</span>, dateofbirth<span style="color: #fff0f5;">)</span> <span style="color: #51afef; font-style: italic;">as</span> doba <span style="color: #51afef; font-style: italic;">from</span> employees;
</pre>
</div>

<ul class="org-ul">
<li>name of the most rented product</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">select</span> products.prod_id, <span style="color: #51afef; font-style: italic;">name</span>, <span style="color: #c678dd;">count</span><span style="color: #fff0f5;">(</span>*<span style="color: #fff0f5;">)</span> <span style="color: #51afef; font-style: italic;">as</span> total
<span style="color: #51afef; font-style: italic;">from</span> products, rentals
<span style="color: #51afef; font-style: italic;">where</span> products.prod_id = rentals.prod_id
<span style="color: #51afef; font-style: italic;">group</span> <span style="color: #51afef; font-style: italic;">by</span> <span style="color: #51afef; font-style: italic;">name</span>
<span style="color: #51afef; font-style: italic;">order</span> <span style="color: #51afef; font-style: italic;">by</span> total <span style="color: #51afef; font-style: italic;">desc</span>
<span style="color: #51afef; font-style: italic;">limit</span> 1;
</pre>
</div>

<ul class="org-ul">
<li>who is the best customer</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">select</span> customers.cus_id, firstname, lastname, <span style="color: #c678dd;">count</span><span style="color: #fff0f5;">(</span>*<span style="color: #fff0f5;">)</span> <span style="color: #51afef; font-style: italic;">as</span> total
<span style="color: #51afef; font-style: italic;">from</span> rentals, customers
<span style="color: #51afef; font-style: italic;">where</span> customers.cus_id = rentals.cus_id
<span style="color: #51afef; font-style: italic;">group</span> <span style="color: #51afef; font-style: italic;">by</span> cus_id
<span style="color: #51afef; font-style: italic;">order</span> <span style="color: #51afef; font-style: italic;">by</span> total <span style="color: #51afef; font-style: italic;">desc</span>
<span style="color: #51afef; font-style: italic;">limit</span> 1;
</pre>
</div>

<ul class="org-ul">
<li>top rentals per genre</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #fff0f5;">(</span><span style="color: #51afef; font-style: italic;">select</span> products.prod_id, <span style="color: #51afef; font-style: italic;">name</span>, <span style="color: #c678dd;">count</span><span style="color: #c678dd;">(</span>*<span style="color: #c678dd;">)</span> <span style="color: #51afef; font-style: italic;">as</span> total, genre
<span style="color: #51afef; font-style: italic;">from</span> products, rentals
<span style="color: #51afef; font-style: italic;">where</span> products.prod_id = rentals.prod_id
<span style="color: #51afef; font-style: italic;">and</span> genre = "Science Fiction"
<span style="color: #51afef; font-style: italic;">group</span> <span style="color: #51afef; font-style: italic;">by</span> prod_id
<span style="color: #51afef; font-style: italic;">order</span> <span style="color: #51afef; font-style: italic;">by</span> total <span style="color: #51afef; font-style: italic;">desc</span>
<span style="color: #51afef; font-style: italic;">limit</span> 1<span style="color: #fff0f5;">)</span>
<span style="color: #51afef; font-style: italic;">UNION</span>
<span style="color: #fff0f5;">(</span><span style="color: #51afef; font-style: italic;">select</span> products.prod_id, <span style="color: #51afef; font-style: italic;">name</span>, <span style="color: #c678dd;">count</span><span style="color: #c678dd;">(</span>*<span style="color: #c678dd;">)</span> <span style="color: #51afef; font-style: italic;">as</span> total, genre
<span style="color: #51afef; font-style: italic;">from</span> products, rentals
<span style="color: #51afef; font-style: italic;">where</span> products.prod_id = rentals.prod_id
<span style="color: #51afef; font-style: italic;">and</span> genre = "Drama"
<span style="color: #51afef; font-style: italic;">group</span> <span style="color: #51afef; font-style: italic;">by</span> prod_id
<span style="color: #51afef; font-style: italic;">order</span> <span style="color: #51afef; font-style: italic;">by</span> total <span style="color: #51afef; font-style: italic;">desc</span>
<span style="color: #51afef; font-style: italic;">limit</span> 1<span style="color: #fff0f5;">)</span>
<span style="color: #51afef; font-style: italic;">UNION</span>
<span style="color: #fff0f5;">(</span><span style="color: #51afef; font-style: italic;">select</span> products.prod_id, <span style="color: #51afef; font-style: italic;">name</span>, <span style="color: #c678dd;">count</span><span style="color: #c678dd;">(</span>*<span style="color: #c678dd;">)</span> <span style="color: #51afef; font-style: italic;">as</span> total, genre
<span style="color: #51afef; font-style: italic;">from</span> products, rentals
<span style="color: #51afef; font-style: italic;">where</span> products.prod_id = rentals.prod_id
<span style="color: #51afef; font-style: italic;">and</span> genre = "Comedy"
<span style="color: #51afef; font-style: italic;">group</span> <span style="color: #51afef; font-style: italic;">by</span> prod_id
<span style="color: #51afef; font-style: italic;">order</span> <span style="color: #51afef; font-style: italic;">by</span> total <span style="color: #51afef; font-style: italic;">desc</span>
<span style="color: #51afef; font-style: italic;">limit</span> 1<span style="color: #fff0f5;">)</span>;
</pre>
</div>

<ul class="org-ul">
<li>which product was rented first</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">select</span> <span style="color: #51afef; font-style: italic;">name</span>, dateRented
<span style="color: #51afef; font-style: italic;">from</span> rentals, products
<span style="color: #51afef; font-style: italic;">where</span> rentals.prod_id = products.prod_id
<span style="color: #51afef; font-style: italic;">order</span> <span style="color: #51afef; font-style: italic;">by</span> daterented
<span style="color: #51afef; font-style: italic;">limit</span> 1;
</pre>
</div>

<ul class="org-ul">
<li>which product was never rented</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">select</span> <span style="color: #51afef; font-style: italic;">name</span>
<span style="color: #51afef; font-style: italic;">from</span> products
<span style="color: #51afef; font-style: italic;">where</span> prod_id
<span style="color: #51afef; font-style: italic;">not</span> <span style="color: #51afef; font-style: italic;">in</span>
<span style="color: #fff0f5;">(</span><span style="color: #51afef; font-style: italic;">select</span> <span style="color: #51afef; font-style: italic;">distinct</span> prod_id <span style="color: #51afef; font-style: italic;">from</span> rentals<span style="color: #fff0f5;">)</span>;
</pre>
</div>

<ul class="org-ul">
<li>top 3 rentals in september 2010</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">select</span> products.prod_id, <span style="color: #51afef; font-style: italic;">name</span>, <span style="color: #c678dd;">count</span><span style="color: #fff0f5;">(</span>*<span style="color: #fff0f5;">)</span> <span style="color: #51afef; font-style: italic;">as</span> total
<span style="color: #51afef; font-style: italic;">from</span> products, rentals
<span style="color: #51afef; font-style: italic;">where</span> products.prod_id = rentals.prod_id
<span style="color: #51afef; font-style: italic;">and</span> monthname<span style="color: #fff0f5;">(</span>rentals.daterented<span style="color: #fff0f5;">)</span> = "September"
<span style="color: #51afef; font-style: italic;">and</span> <span style="color: #51afef; font-style: italic;">year</span><span style="color: #fff0f5;">(</span>rentals.daterented<span style="color: #fff0f5;">)</span> = 2010
<span style="color: #51afef; font-style: italic;">group</span> <span style="color: #51afef; font-style: italic;">by</span> <span style="color: #51afef; font-style: italic;">name</span>
<span style="color: #51afef; font-style: italic;">order</span> <span style="color: #51afef; font-style: italic;">by</span> total <span style="color: #51afef; font-style: italic;">desc</span>
<span style="color: #51afef; font-style: italic;">limit</span> 3;
</pre>
</div>
<ul class="org-ul">
<li>list the products that the customers haven't rented</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">select</span> <span style="color: #51afef; font-style: italic;">name</span>, firstname, lastname
<span style="color: #51afef; font-style: italic;">from</span> customers c, products p
<span style="color: #51afef; font-style: italic;">where</span> <span style="color: #51afef; font-style: italic;">not</span> <span style="color: #51afef; font-style: italic;">exists</span>
<span style="color: #fff0f5;">(</span><span style="color: #51afef; font-style: italic;">select</span> <span style="color: #51afef; font-style: italic;">distinct</span> <span style="color: #51afef; font-style: italic;">name</span>, firstname, lastname
<span style="color: #51afef; font-style: italic;">from</span> rentals, products p1, customers c1
<span style="color: #51afef; font-style: italic;">where</span> rentals.prod_id = p1.prod_id
<span style="color: #51afef; font-style: italic;">and</span> rentals.cus_id = c1.cus_id
<span style="color: #51afef; font-style: italic;">and</span> p.<span style="color: #51afef; font-style: italic;">name</span> = p1.<span style="color: #51afef; font-style: italic;">name</span>
<span style="color: #51afef; font-style: italic;">and</span> c.firstname = c1.firstname
<span style="color: #51afef; font-style: italic;">and</span> c.lastname = c1.lastname<span style="color: #fff0f5;">)</span>;
</pre>
</div>

<ul class="org-ul">
<li>pretty print table</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">select</span> rentals.rental_id,
<span style="color: #51afef; font-style: italic;">name</span>,
customers.firstname <span style="color: #51afef; font-style: italic;">as</span> cfName,
customers.lastname clName,
employees.firstname <span style="color: #51afef; font-style: italic;">as</span> efName,
employees.lastname <span style="color: #51afef; font-style: italic;">as</span> elName,
date_format<span style="color: #fff0f5;">(</span>rentals.daterented, "%W %<span style="color: #51afef; font-style: italic;">M</span> %e %Y"<span style="color: #fff0f5;">)</span> <span style="color: #51afef; font-style: italic;">as</span> "<span style="color: #ECBE7B;">Date</span> Rented"
<span style="color: #51afef; font-style: italic;">from</span> rentals, products, employees, customers
<span style="color: #51afef; font-style: italic;">where</span> rentals.prod_id = products.prod_id
<span style="color: #51afef; font-style: italic;">and</span> rentals.cus_id = customers.cus_id
<span style="color: #51afef; font-style: italic;">and</span> rentals.emp_id = employees.emp_id
<span style="color: #51afef; font-style: italic;">order</span> <span style="color: #51afef; font-style: italic;">by</span> rental_id;
</pre>
</div>
<ul class="org-ul">
<li>can customer 'Carey' rent out a film for 21s?</li>
<li>first: the age of all customers</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">select</span> firstname, lastname, dateofbirth,
date_format<span style="color: #fff0f5;">(</span>from_days<span style="color: #c678dd;">(</span>datediff<span style="color: #98be65;">(</span>now<span style="color: #00bfff;">()</span>, dateofbirth<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>, <span style="color: #98be65;">'%y'</span><span style="color: #fff0f5;">)</span> <span style="color: #51afef; font-style: italic;">as</span> age
<span style="color: #51afef; font-style: italic;">from</span> customers;
</pre>
</div>
<ul class="org-ul">
<li>second: customers who can rent a 21s film</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">select</span> firstname, lastname, dateofbirth,
date_format<span style="color: #fff0f5;">(</span>from_days<span style="color: #c678dd;">(</span>datediff<span style="color: #98be65;">(</span>now<span style="color: #00bfff;">()</span>, dateofbirth<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>, <span style="color: #98be65;">'%y'</span><span style="color: #fff0f5;">)</span> <span style="color: #51afef; font-style: italic;">as</span> age
<span style="color: #51afef; font-style: italic;">from</span> customers
<span style="color: #51afef; font-style: italic;">where</span> date_format<span style="color: #fff0f5;">(</span>from_days<span style="color: #c678dd;">(</span>datediff<span style="color: #98be65;">(</span>now<span style="color: #00bfff;">()</span>, dateofbirth<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>, <span style="color: #98be65;">'%y'</span><span style="color: #fff0f5;">)</span> &gt;= 21;
</pre>
</div>
<ul class="org-ul">
<li>third: customers who cannot rent a 21s film</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">select</span> firstname, lastname, dateofbirth,
date_format<span style="color: #fff0f5;">(</span>from_days<span style="color: #c678dd;">(</span>datediff<span style="color: #98be65;">(</span>now<span style="color: #00bfff;">()</span>, dateofbirth<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>, <span style="color: #98be65;">'%y'</span><span style="color: #fff0f5;">)</span> <span style="color: #51afef; font-style: italic;">as</span> age
<span style="color: #51afef; font-style: italic;">from</span> customers
<span style="color: #51afef; font-style: italic;">where</span> date_format<span style="color: #fff0f5;">(</span>from_days<span style="color: #c678dd;">(</span>datediff<span style="color: #98be65;">(</span>now<span style="color: #00bfff;">()</span>, dateofbirth<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>, <span style="color: #98be65;">'%y'</span><span style="color: #fff0f5;">)</span> &lt; 21;
</pre>
</div>
<ul class="org-ul">
<li>who is the worst employee</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">select</span> firstname, lastname,
employees.emp_id <span style="color: #51afef; font-style: italic;">as</span> emp_id,
<span style="color: #c678dd;">count</span><span style="color: #fff0f5;">(</span>*<span style="color: #fff0f5;">)</span> <span style="color: #51afef; font-style: italic;">as</span> total
<span style="color: #51afef; font-style: italic;">from</span> employees, rentals
<span style="color: #51afef; font-style: italic;">where</span> rentals.emp_id = employees.emp_id
<span style="color: #51afef; font-style: italic;">group</span> <span style="color: #51afef; font-style: italic;">by</span> employees.emp_id
<span style="color: #51afef; font-style: italic;">order</span> <span style="color: #51afef; font-style: italic;">by</span> total;
</pre>
</div>
<ul class="org-ul">
<li>calculate the sales of dvd (5eur) and blurays (6eur) in september</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">select</span> 5 * dvd.total + 6 * blu.total <span style="color: #51afef; font-style: italic;">as</span> total
<span style="color: #51afef; font-style: italic;">from</span> <span style="color: #fff0f5;">(</span><span style="color: #51afef; font-style: italic;">select</span> format, <span style="color: #c678dd;">count</span><span style="color: #c678dd;">(</span>*<span style="color: #c678dd;">)</span> <span style="color: #51afef; font-style: italic;">as</span> total
<span style="color: #51afef; font-style: italic;">from</span> products, rentals
<span style="color: #51afef; font-style: italic;">where</span> products.prod_id = rentals.prod_id
<span style="color: #51afef; font-style: italic;">and</span> <span style="color: #51afef; font-style: italic;">year</span><span style="color: #c678dd;">(</span>daterented<span style="color: #c678dd;">)</span> = 2010 <span style="color: #51afef; font-style: italic;">and</span> <span style="color: #51afef; font-style: italic;">month</span><span style="color: #c678dd;">(</span>daterented<span style="color: #c678dd;">)</span> = 9
<span style="color: #51afef; font-style: italic;">and</span> format = <span style="color: #98be65;">'DVD'</span><span style="color: #fff0f5;">)</span> <span style="color: #51afef; font-style: italic;">as</span> dvd,
<span style="color: #fff0f5;">(</span><span style="color: #51afef; font-style: italic;">select</span> format, <span style="color: #c678dd;">count</span><span style="color: #c678dd;">(</span>*<span style="color: #c678dd;">)</span> <span style="color: #51afef; font-style: italic;">as</span> total
<span style="color: #51afef; font-style: italic;">from</span> products, rentals
<span style="color: #51afef; font-style: italic;">where</span> products.prod_id = rentals.prod_id
<span style="color: #51afef; font-style: italic;">and</span> <span style="color: #51afef; font-style: italic;">year</span><span style="color: #c678dd;">(</span>daterented<span style="color: #c678dd;">)</span> = 2010 <span style="color: #51afef; font-style: italic;">and</span> <span style="color: #51afef; font-style: italic;">month</span><span style="color: #c678dd;">(</span>daterented<span style="color: #c678dd;">)</span> = 9
<span style="color: #51afef; font-style: italic;">and</span> format = <span style="color: #98be65;">'Blu-ray'</span><span style="color: #fff0f5;">)</span> <span style="color: #51afef; font-style: italic;">as</span> blu;
</pre>
</div>
</div>
</div>
