notes/y2/databases.org
* Sample questions for the test
  - show all regions in africa
  #+BEGIN_SRC sql
select distinct region from country where continent = 'Africa';
  #+END_SRC
  - show the population of the world
  #+BEGIN_SRC sql
select sum(population) as total from country;
  #+END_SRC
  - count the countries in the world
  #+BEGIN_SRC sql
select count(*) as total from country;
  #+END_SRC
  - count all languages
  #+BEGIN_SRC sql
select count(distinct language) as "total languages"
from countrylanguage;
  #+END_SRC
  - total surface area of Earth, oceans are 2/3 of the earth's surface, thus we multiply by 3 to get the total surface
  #+BEGIN_SRC sql
select sum(surfacearea) * 3 from country;
  #+END_SRC
  - get the total amount of cities in a country
  #+BEGIN_SRC sql
select country.name, count(city.name)
from country, city
where code = countrycode
and country.name = 'Ireland';
  #+END_SRC
  - find the city with the highest population in a specific country
  #+BEGIN_SRC sql
select country.name, city.name, city.population
from country, city
where code = countrycode
and city.population = (select max(population) from city);
  #+END_SRC
  - display the total population of a country and the list of all cities with their population
  #+BEGIN_SRC sql
(select name as 'Details', population as 'Inhabitants'
from country
where name = 'Spain')
union
(select city.name, city.population
from city, country
where countrycode = code
and country.name = 'Spain');
  #+END_SRC
  - find all languages in Ireland and Canada that are not common in each of those countries
  #+BEGIN_SRC sql
select cl1.language
from country as c1, countrylanguage as cl1
where c1.code = cl1.countrycode
and c1.name = 'Ireland'
and NOT EXISTS
(select cl2.language
from country as c2, countrylanguage as cl2
where c2.code = cl2.countrycode
and cl1.language = cl2.language
and c2.name = 'Canada');
  #+END_SRC
  - find all langauges that are common in Canada and Ireland
  #+BEGIN_SRC sql
select cl1.language
from country as c1, countrylanguage as cl1
where c1.code = cl1.countrycode
and c1.name = 'Ireland'
and EXISTS
(select cl2.language
from country as c2, countrylanguage as cl2
where c2.code = cl2.countrycode
and cl1.language = cl2.language
and c2.name = 'Canada');
  #+END_SRC

* Table creation example
  #+BEGIN_SRC sql
CREATE TABLE details (
       id INTEGER auto_increment NOT NULL PRIMARY KEY,
       firstName VARCHAR(15) NOT NULL,
       lastName VARCHAR(20) NOT NULL,
       age INTEGER NOT NULL,
       gender VARCHAR(1) NOT NULL,
       position VARCHAR(15) NOT NULL,
       department VARCHAR(20) NOT NULL,
       rate DECIMAL(7, 2) NOT NULL,
       hours INTEGER NOT NULL
);
  #+END_SRC

