notes/y2/databases.html

<div id="outline-container-org3c291d9" class="outline-2">
<h2 id="org3c291d9"><span class="section-number-2">22</span> Sample questions for the test</h2>
<div class="outline-text-2" id="text-22">
<ul class="org-ul">
<li>show all regions in africa</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">select</span> <span style="color: #51afef; font-style: italic;">distinct</span> region <span style="color: #51afef; font-style: italic;">from</span> country <span style="color: #51afef; font-style: italic;">where</span> continent = <span style="color: #98be65;">'Africa'</span>;
</pre>
</div>
<ul class="org-ul">
<li>show the population of the world</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">select</span> <span style="color: #c678dd;">sum</span><span style="color: #fff0f5;">(</span>population<span style="color: #fff0f5;">)</span> <span style="color: #51afef; font-style: italic;">as</span> total <span style="color: #51afef; font-style: italic;">from</span> country;
</pre>
</div>
<ul class="org-ul">
<li>count the countries in the world</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">select</span> <span style="color: #c678dd;">count</span><span style="color: #fff0f5;">(</span>*<span style="color: #fff0f5;">)</span> <span style="color: #51afef; font-style: italic;">as</span> total <span style="color: #51afef; font-style: italic;">from</span> country;
</pre>
</div>
<ul class="org-ul">
<li>count all languages</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">select</span> <span style="color: #c678dd;">count</span><span style="color: #fff0f5;">(</span><span style="color: #51afef; font-style: italic;">distinct</span> <span style="color: #51afef; font-style: italic;">language</span><span style="color: #fff0f5;">)</span> <span style="color: #51afef; font-style: italic;">as</span> "total languages"
<span style="color: #51afef; font-style: italic;">from</span> countrylanguage;
</pre>
</div>
<ul class="org-ul">
<li>total surface area of Earth, oceans are 2/3 of the earth's surface, thus we multiply by 3 to get the total surface</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">select</span> <span style="color: #c678dd;">sum</span><span style="color: #fff0f5;">(</span>surfacearea<span style="color: #fff0f5;">)</span> * 3 <span style="color: #51afef; font-style: italic;">from</span> country;
</pre>
</div>
<ul class="org-ul">
<li>get the total amount of cities in a country</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">select</span> country.<span style="color: #51afef; font-style: italic;">name</span>, <span style="color: #c678dd;">count</span><span style="color: #fff0f5;">(</span>city.<span style="color: #51afef; font-style: italic;">name</span><span style="color: #fff0f5;">)</span>
<span style="color: #51afef; font-style: italic;">from</span> country, city
<span style="color: #51afef; font-style: italic;">where</span> code = countrycode
<span style="color: #51afef; font-style: italic;">and</span> country.<span style="color: #51afef; font-style: italic;">name</span> = <span style="color: #98be65;">'Ireland'</span>;
</pre>
</div>
<ul class="org-ul">
<li>find the city with the highest population in a specific country</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">select</span> country.<span style="color: #51afef; font-style: italic;">name</span>, city.<span style="color: #51afef; font-style: italic;">name</span>, city.population
<span style="color: #51afef; font-style: italic;">from</span> country, city
<span style="color: #51afef; font-style: italic;">where</span> code = countrycode
<span style="color: #51afef; font-style: italic;">and</span> city.population = <span style="color: #fff0f5;">(</span><span style="color: #51afef; font-style: italic;">select</span> <span style="color: #c678dd;">max</span><span style="color: #c678dd;">(</span>population<span style="color: #c678dd;">)</span> <span style="color: #51afef; font-style: italic;">from</span> city<span style="color: #fff0f5;">)</span>;
</pre>
</div>
<ul class="org-ul">
<li>display the total population of a country and the list of all cities with their population</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #fff0f5;">(</span><span style="color: #51afef; font-style: italic;">select</span> <span style="color: #51afef; font-style: italic;">name</span> <span style="color: #51afef; font-style: italic;">as</span> <span style="color: #98be65;">'Details'</span>, population <span style="color: #51afef; font-style: italic;">as</span> <span style="color: #98be65;">'Inhabitants'</span>
<span style="color: #51afef; font-style: italic;">from</span> country
<span style="color: #51afef; font-style: italic;">where</span> <span style="color: #51afef; font-style: italic;">name</span> = <span style="color: #98be65;">'Spain'</span><span style="color: #fff0f5;">)</span>
<span style="color: #51afef; font-style: italic;">union</span>
<span style="color: #fff0f5;">(</span><span style="color: #51afef; font-style: italic;">select</span> city.<span style="color: #51afef; font-style: italic;">name</span>, city.population
<span style="color: #51afef; font-style: italic;">from</span> city, country
<span style="color: #51afef; font-style: italic;">where</span> countrycode = code
<span style="color: #51afef; font-style: italic;">and</span> country.<span style="color: #51afef; font-style: italic;">name</span> = <span style="color: #98be65;">'Spain'</span><span style="color: #fff0f5;">)</span>;
</pre>
</div>
<ul class="org-ul">
<li>find all languages in Ireland and Canada that are not common in each of those countries</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">select</span> cl1.<span style="color: #51afef; font-style: italic;">language</span>
<span style="color: #51afef; font-style: italic;">from</span> country <span style="color: #51afef; font-style: italic;">as</span> c1, countrylanguage <span style="color: #51afef; font-style: italic;">as</span> cl1
<span style="color: #51afef; font-style: italic;">where</span> c1.code = cl1.countrycode
<span style="color: #51afef; font-style: italic;">and</span> c1.<span style="color: #51afef; font-style: italic;">name</span> = <span style="color: #98be65;">'Ireland'</span>
<span style="color: #51afef; font-style: italic;">and</span> <span style="color: #51afef; font-style: italic;">NOT</span> <span style="color: #51afef; font-style: italic;">EXISTS</span>
<span style="color: #fff0f5;">(</span><span style="color: #51afef; font-style: italic;">select</span> cl2.<span style="color: #51afef; font-style: italic;">language</span>
<span style="color: #51afef; font-style: italic;">from</span> country <span style="color: #51afef; font-style: italic;">as</span> c2, countrylanguage <span style="color: #51afef; font-style: italic;">as</span> cl2
<span style="color: #51afef; font-style: italic;">where</span> c2.code = cl2.countrycode
<span style="color: #51afef; font-style: italic;">and</span> cl1.<span style="color: #51afef; font-style: italic;">language</span> = cl2.<span style="color: #51afef; font-style: italic;">language</span>
<span style="color: #51afef; font-style: italic;">and</span> c2.<span style="color: #51afef; font-style: italic;">name</span> = <span style="color: #98be65;">'Canada'</span><span style="color: #fff0f5;">)</span>;
</pre>
</div>
<ul class="org-ul">
<li>find all langauges that are common in Canada and Ireland</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">select</span> cl1.<span style="color: #51afef; font-style: italic;">language</span>
<span style="color: #51afef; font-style: italic;">from</span> country <span style="color: #51afef; font-style: italic;">as</span> c1, countrylanguage <span style="color: #51afef; font-style: italic;">as</span> cl1
<span style="color: #51afef; font-style: italic;">where</span> c1.code = cl1.countrycode
<span style="color: #51afef; font-style: italic;">and</span> c1.<span style="color: #51afef; font-style: italic;">name</span> = <span style="color: #98be65;">'Ireland'</span>
<span style="color: #51afef; font-style: italic;">and</span> <span style="color: #51afef; font-style: italic;">EXISTS</span>
<span style="color: #fff0f5;">(</span><span style="color: #51afef; font-style: italic;">select</span> cl2.<span style="color: #51afef; font-style: italic;">language</span>
<span style="color: #51afef; font-style: italic;">from</span> country <span style="color: #51afef; font-style: italic;">as</span> c2, countrylanguage <span style="color: #51afef; font-style: italic;">as</span> cl2
<span style="color: #51afef; font-style: italic;">where</span> c2.code = cl2.countrycode
<span style="color: #51afef; font-style: italic;">and</span> cl1.<span style="color: #51afef; font-style: italic;">language</span> = cl2.<span style="color: #51afef; font-style: italic;">language</span>
<span style="color: #51afef; font-style: italic;">and</span> c2.<span style="color: #51afef; font-style: italic;">name</span> = <span style="color: #98be65;">'Canada'</span><span style="color: #fff0f5;">)</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb4e1219" class="outline-2">
<h2 id="orgb4e1219"><span class="section-number-2">23</span> Table creation example</h2>
<div class="outline-text-2" id="text-23">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">CREATE</span> <span style="color: #51afef; font-style: italic;">TABLE</span> <span style="color: #c678dd;">details</span> <span style="color: #fff0f5;">(</span>
       id <span style="color: #ECBE7B;">INTEGER</span> auto_increment <span style="color: #51afef; font-style: italic;">NOT</span> <span style="color: #51afef; font-style: italic;">NULL</span> <span style="color: #51afef; font-style: italic;">PRIMARY</span> <span style="color: #51afef; font-style: italic;">KEY</span>,
       firstName <span style="color: #ECBE7B;">VARCHAR</span><span style="color: #c678dd;">(</span>15<span style="color: #c678dd;">)</span> <span style="color: #51afef; font-style: italic;">NOT</span> <span style="color: #51afef; font-style: italic;">NULL</span>,
       lastName <span style="color: #ECBE7B;">VARCHAR</span><span style="color: #c678dd;">(</span>20<span style="color: #c678dd;">)</span> <span style="color: #51afef; font-style: italic;">NOT</span> <span style="color: #51afef; font-style: italic;">NULL</span>,
       age <span style="color: #ECBE7B;">INTEGER</span> <span style="color: #51afef; font-style: italic;">NOT</span> <span style="color: #51afef; font-style: italic;">NULL</span>,
       gender <span style="color: #ECBE7B;">VARCHAR</span><span style="color: #c678dd;">(</span>1<span style="color: #c678dd;">)</span> <span style="color: #51afef; font-style: italic;">NOT</span> <span style="color: #51afef; font-style: italic;">NULL</span>,
       <span style="color: #51afef; font-style: italic;">position</span> <span style="color: #ECBE7B;">VARCHAR</span><span style="color: #c678dd;">(</span>15<span style="color: #c678dd;">)</span> <span style="color: #51afef; font-style: italic;">NOT</span> <span style="color: #51afef; font-style: italic;">NULL</span>,
       department <span style="color: #ECBE7B;">VARCHAR</span><span style="color: #c678dd;">(</span>20<span style="color: #c678dd;">)</span> <span style="color: #51afef; font-style: italic;">NOT</span> <span style="color: #51afef; font-style: italic;">NULL</span>,
       rate <span style="color: #ECBE7B;">DECIMAL</span><span style="color: #c678dd;">(</span>7, 2<span style="color: #c678dd;">)</span> <span style="color: #51afef; font-style: italic;">NOT</span> <span style="color: #51afef; font-style: italic;">NULL</span>,
       hours <span style="color: #ECBE7B;">INTEGER</span> <span style="color: #51afef; font-style: italic;">NOT</span> <span style="color: #51afef; font-style: italic;">NULL</span>
<span style="color: #fff0f5;">)</span>;
</pre>
</div>
</div>
</div>
