notes/y2/databases.html

<div id="outline-container-orga4c0faf" class="outline-2">
<h2 id="orga4c0faf"><span class="section-number-2">24</span> Sample database insert</h2>
<div class="outline-text-2" id="text-24">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef; font-style: italic;">DROP</span> DATABASE IF <span style="color: #51afef; font-style: italic;">EXISTS</span> lab1SQL;
<span style="color: #51afef; font-style: italic;">CREATE</span> DATABASE IF <span style="color: #51afef; font-style: italic;">NOT</span> <span style="color: #51afef; font-style: italic;">EXISTS</span> lab1SQL;
USE lab1SQL;

<span style="color: #51afef; font-style: italic;">SELECT</span> <span style="color: #98be65;">'CREATING DATABASE STRUCTURE'</span> <span style="color: #51afef; font-style: italic;">as</span> <span style="color: #98be65;">'INFO'</span>;

<span style="color: #51afef; font-style: italic;">DROP</span> <span style="color: #51afef; font-style: italic;">TABLE</span> <span style="color: #c678dd;">IF</span> <span style="color: #51afef; font-style: italic;">EXISTS</span> details;


<span style="color: #51afef; font-style: italic;">CREATE</span> <span style="color: #51afef; font-style: italic;">TABLE</span> <span style="color: #c678dd;">details</span> <span style="color: #fff0f5;">(</span>
    id <span style="color: #ECBE7B;">INTEGER</span> AUTO_INCREMENT <span style="color: #51afef; font-style: italic;">NOT</span> <span style="color: #51afef; font-style: italic;">NULL</span> <span style="color: #51afef; font-style: italic;">PRIMARY</span> <span style="color: #51afef; font-style: italic;">KEY</span>,
    firstName <span style="color: #ECBE7B;">VARCHAR</span><span style="color: #c678dd;">(</span>15<span style="color: #c678dd;">)</span> <span style="color: #51afef; font-style: italic;">NOT</span> <span style="color: #51afef; font-style: italic;">NULL</span>,
    lastName <span style="color: #ECBE7B;">VARCHAR</span><span style="color: #c678dd;">(</span>20<span style="color: #c678dd;">)</span> <span style="color: #51afef; font-style: italic;">NOT</span> <span style="color: #51afef; font-style: italic;">NULL</span>,
    age <span style="color: #ECBE7B;">INTEGER</span> <span style="color: #51afef; font-style: italic;">NOT</span> <span style="color: #51afef; font-style: italic;">NULL</span>,
    gender <span style="color: #ECBE7B;">VARCHAR</span><span style="color: #c678dd;">(</span>1<span style="color: #c678dd;">)</span> <span style="color: #51afef; font-style: italic;">NOT</span> <span style="color: #51afef; font-style: italic;">NULL</span>,
    <span style="color: #51afef; font-style: italic;">position</span> <span style="color: #ECBE7B;">VARCHAR</span><span style="color: #c678dd;">(</span>15<span style="color: #c678dd;">)</span> <span style="color: #51afef; font-style: italic;">NOT</span> <span style="color: #51afef; font-style: italic;">NULL</span>,
    department <span style="color: #ECBE7B;">VARCHAR</span><span style="color: #c678dd;">(</span>20<span style="color: #c678dd;">)</span> <span style="color: #51afef; font-style: italic;">NOT</span> <span style="color: #51afef; font-style: italic;">NULL</span>,
    rate <span style="color: #ECBE7B;">DECIMAL</span><span style="color: #c678dd;">(</span>7, 2<span style="color: #c678dd;">)</span> <span style="color: #51afef; font-style: italic;">NOT</span> <span style="color: #51afef; font-style: italic;">NULL</span>,
    hours <span style="color: #ECBE7B;">INTEGER</span> <span style="color: #51afef; font-style: italic;">NOT</span> <span style="color: #51afef; font-style: italic;">NULL</span><span style="color: #fff0f5;">)</span>;

<span style="color: #51afef; font-style: italic;">SELECT</span> <span style="color: #98be65;">'INSERTING DATA INTO DATABASE'</span> <span style="color: #51afef; font-style: italic;">as</span> <span style="color: #98be65;">'INFO'</span>;

<span style="color: #51afef; font-style: italic;">INSERT</span> <span style="color: #51afef; font-style: italic;">INTO</span> details <span style="color: #51afef; font-style: italic;">VALUES</span> <span style="color: #fff0f5;">(</span> <span style="color: #51afef; font-style: italic;">null</span>, <span style="color: #98be65;">'Joe'</span>, <span style="color: #98be65;">'Mullins'</span>, 64, <span style="color: #98be65;">'M'</span>, <span style="color: #98be65;">'Lecturer'</span>, <span style="color: #98be65;">'Engineering'</span>, 63.08, 12<span style="color: #fff0f5;">)</span>;
<span style="color: #51afef; font-style: italic;">INSERT</span> <span style="color: #51afef; font-style: italic;">INTO</span> details <span style="color: #51afef; font-style: italic;">VALUES</span> <span style="color: #fff0f5;">(</span> <span style="color: #51afef; font-style: italic;">null</span>, <span style="color: #98be65;">'Joan'</span>, <span style="color: #98be65;">'Macgill'</span>, 27, <span style="color: #98be65;">'F'</span>, <span style="color: #98be65;">'Researcher'</span>, <span style="color: #98be65;">'Science'</span>, 38, 35<span style="color: #fff0f5;">)</span>;
<span style="color: #51afef; font-style: italic;">INSERT</span> <span style="color: #51afef; font-style: italic;">INTO</span> details <span style="color: #51afef; font-style: italic;">VALUES</span> <span style="color: #fff0f5;">(</span> <span style="color: #51afef; font-style: italic;">null</span>, <span style="color: #98be65;">'Jim'</span>, <span style="color: #98be65;">'Mitchell'</span>, 51, <span style="color: #98be65;">'M'</span>, <span style="color: #98be65;">'Researcher'</span>, <span style="color: #98be65;">'Business'</span>, 38, 25<span style="color: #fff0f5;">)</span>;
<span style="color: #51afef; font-style: italic;">INSERT</span> <span style="color: #51afef; font-style: italic;">INTO</span> details <span style="color: #51afef; font-style: italic;">VALUES</span> <span style="color: #fff0f5;">(</span> <span style="color: #51afef; font-style: italic;">null</span>, <span style="color: #98be65;">'John'</span>, <span style="color: #98be65;">'Magner'</span>, 47, <span style="color: #98be65;">'M'</span>, <span style="color: #98be65;">'Lecturer'</span>, <span style="color: #98be65;">'Humanities'</span>, 63.08, 16<span style="color: #fff0f5;">)</span>;
<span style="color: #51afef; font-style: italic;">INSERT</span> <span style="color: #51afef; font-style: italic;">INTO</span> details <span style="color: #51afef; font-style: italic;">VALUES</span> <span style="color: #fff0f5;">(</span> <span style="color: #51afef; font-style: italic;">null</span>, <span style="color: #98be65;">'Jack'</span>, <span style="color: #98be65;">'Minogue'</span>, 61, <span style="color: #98be65;">'M'</span>, <span style="color: #98be65;">'Administrator'</span>, <span style="color: #98be65;">'Hospitality'</span>, 45.57, 37<span style="color: #fff0f5;">)</span>;
<span style="color: #51afef; font-style: italic;">INSERT</span> <span style="color: #51afef; font-style: italic;">INTO</span> details <span style="color: #51afef; font-style: italic;">VALUES</span> <span style="color: #fff0f5;">(</span> <span style="color: #51afef; font-style: italic;">null</span>, <span style="color: #98be65;">'Jean'</span>, <span style="color: #98be65;">'Madden'</span>, 45, <span style="color: #98be65;">'F'</span>, <span style="color: #98be65;">'Professor'</span>, <span style="color: #98be65;">'Design'</span>, 76.45, 14<span style="color: #fff0f5;">)</span>;
<span style="color: #51afef; font-style: italic;">INSERT</span> <span style="color: #51afef; font-style: italic;">INTO</span> details <span style="color: #51afef; font-style: italic;">VALUES</span> <span style="color: #fff0f5;">(</span> <span style="color: #51afef; font-style: italic;">null</span>, <span style="color: #98be65;">'Josephine'</span>, <span style="color: #98be65;">'Mahony'</span>, 33, <span style="color: #98be65;">'F'</span>, <span style="color: #98be65;">'Head'</span>, <span style="color: #98be65;">'Nursing'</span>, 98.56, 40<span style="color: #fff0f5;">)</span>;
<span style="color: #51afef; font-style: italic;">INSERT</span> <span style="color: #51afef; font-style: italic;">INTO</span> details <span style="color: #51afef; font-style: italic;">VALUES</span> <span style="color: #fff0f5;">(</span> <span style="color: #51afef; font-style: italic;">null</span>, <span style="color: #98be65;">'Juan'</span>, <span style="color: #98be65;">'Mosley'</span>, 56, <span style="color: #98be65;">'M'</span>, <span style="color: #98be65;">'Professor'</span>, <span style="color: #98be65;">'Engineering'</span>, 76.45, 11<span style="color: #fff0f5;">)</span>;
<span style="color: #51afef; font-style: italic;">INSERT</span> <span style="color: #51afef; font-style: italic;">INTO</span> details <span style="color: #51afef; font-style: italic;">VALUES</span> <span style="color: #fff0f5;">(</span> <span style="color: #51afef; font-style: italic;">null</span>, <span style="color: #98be65;">'Jamie'</span>, <span style="color: #98be65;">'Mulllen'</span>, 45, <span style="color: #98be65;">'M'</span>, <span style="color: #98be65;">'Researcher'</span>, <span style="color: #98be65;">'Science'</span>, 38, 37<span style="color: #fff0f5;">)</span>;
<span style="color: #51afef; font-style: italic;">INSERT</span> <span style="color: #51afef; font-style: italic;">INTO</span> details <span style="color: #51afef; font-style: italic;">VALUES</span> <span style="color: #fff0f5;">(</span> <span style="color: #51afef; font-style: italic;">null</span>, <span style="color: #98be65;">'Julie'</span>, <span style="color: #98be65;">'Mooney'</span>, 39, <span style="color: #98be65;">'F'</span>, <span style="color: #98be65;">'Lecturer'</span>, <span style="color: #98be65;">'Business'</span>, 63.08, 18<span style="color: #fff0f5;">)</span>;
<span style="color: #51afef; font-style: italic;">INSERT</span> <span style="color: #51afef; font-style: italic;">INTO</span> details <span style="color: #51afef; font-style: italic;">VALUES</span> <span style="color: #fff0f5;">(</span> <span style="color: #51afef; font-style: italic;">null</span>, <span style="color: #98be65;">'Jane'</span>, <span style="color: #98be65;">'Mccarthy'</span>, 37, <span style="color: #98be65;">'F'</span>, <span style="color: #98be65;">'Administrator'</span>, <span style="color: #98be65;">'Design'</span>, 45.57, 45<span style="color: #fff0f5;">)</span>;
<span style="color: #51afef; font-style: italic;">INSERT</span> <span style="color: #51afef; font-style: italic;">INTO</span> details <span style="color: #51afef; font-style: italic;">VALUES</span> <span style="color: #fff0f5;">(</span> <span style="color: #51afef; font-style: italic;">null</span>, <span style="color: #98be65;">'James'</span>, <span style="color: #98be65;">'May'</span>, 38, <span style="color: #98be65;">'M'</span>, <span style="color: #98be65;">'Researcher'</span>, <span style="color: #98be65;">'Hospitality'</span>, 38, 9<span style="color: #fff0f5;">)</span>;
<span style="color: #51afef; font-style: italic;">INSERT</span> <span style="color: #51afef; font-style: italic;">INTO</span> details <span style="color: #51afef; font-style: italic;">VALUES</span> <span style="color: #fff0f5;">(</span> <span style="color: #51afef; font-style: italic;">null</span>, <span style="color: #98be65;">'Joseph'</span>, <span style="color: #98be65;">'Manning'</span>, 32, <span style="color: #98be65;">'M'</span>, <span style="color: #98be65;">'Lecturer'</span>, <span style="color: #98be65;">'Hospitality'</span>, 63.08, 16<span style="color: #fff0f5;">)</span>;
<span style="color: #51afef; font-style: italic;">INSERT</span> <span style="color: #51afef; font-style: italic;">INTO</span> details <span style="color: #51afef; font-style: italic;">VALUES</span> <span style="color: #fff0f5;">(</span> <span style="color: #51afef; font-style: italic;">null</span>, <span style="color: #98be65;">'Judith'</span>, <span style="color: #98be65;">'Milner'</span>, 36, <span style="color: #98be65;">'F'</span>, <span style="color: #98be65;">'Lecturer'</span>, <span style="color: #98be65;">'Nursing'</span>, 63.08, 20<span style="color: #fff0f5;">)</span>;
<span style="color: #51afef; font-style: italic;">INSERT</span> <span style="color: #51afef; font-style: italic;">INTO</span> details <span style="color: #51afef; font-style: italic;">VALUES</span> <span style="color: #fff0f5;">(</span> <span style="color: #51afef; font-style: italic;">null</span>, <span style="color: #98be65;">'Jerome'</span>, <span style="color: #98be65;">'Murphy'</span>, 26, <span style="color: #98be65;">'M'</span>, <span style="color: #98be65;">'Head'</span>, <span style="color: #98be65;">'Engineering'</span>, 98.56, 42<span style="color: #fff0f5;">)</span>;
<span style="color: #51afef; font-style: italic;">INSERT</span> <span style="color: #51afef; font-style: italic;">INTO</span> details <span style="color: #51afef; font-style: italic;">VALUES</span> <span style="color: #fff0f5;">(</span> <span style="color: #51afef; font-style: italic;">null</span>, <span style="color: #98be65;">'Jude'</span>, <span style="color: #98be65;">'Manley'</span>, 28, <span style="color: #98be65;">'M'</span>, <span style="color: #98be65;">'Head'</span>, <span style="color: #98be65;">'Science'</span>, 98.56, 41<span style="color: #fff0f5;">)</span>;
<span style="color: #51afef; font-style: italic;">INSERT</span> <span style="color: #51afef; font-style: italic;">INTO</span> details <span style="color: #51afef; font-style: italic;">VALUES</span> <span style="color: #fff0f5;">(</span> <span style="color: #51afef; font-style: italic;">null</span>, <span style="color: #98be65;">'Juanita'</span>, <span style="color: #98be65;">'Mahon'</span>, 59, <span style="color: #98be65;">'F'</span>, <span style="color: #98be65;">'Administrator'</span>, <span style="color: #98be65;">'Engineering'</span>, 45.57, 49<span style="color: #fff0f5;">)</span>;
<span style="color: #51afef; font-style: italic;">INSERT</span> <span style="color: #51afef; font-style: italic;">INTO</span> details <span style="color: #51afef; font-style: italic;">VALUES</span> <span style="color: #fff0f5;">(</span> <span style="color: #51afef; font-style: italic;">null</span>, <span style="color: #98be65;">'Justin'</span>, <span style="color: #98be65;">'Maguire'</span>, 25, <span style="color: #98be65;">'M'</span>, <span style="color: #98be65;">'Lecturer'</span>, <span style="color: #98be65;">'Business'</span>, 63.08, 16<span style="color: #fff0f5;">)</span>;
<span style="color: #51afef; font-style: italic;">INSERT</span> <span style="color: #51afef; font-style: italic;">INTO</span> details <span style="color: #51afef; font-style: italic;">VALUES</span> <span style="color: #fff0f5;">(</span> <span style="color: #51afef; font-style: italic;">null</span>, <span style="color: #98be65;">'Jacqulinen'</span>, <span style="color: #98be65;">'Musgrave'</span>, 43, <span style="color: #98be65;">'F'</span>, <span style="color: #98be65;">'Professor'</span>, <span style="color: #98be65;">'Business'</span>, 76.45, 10<span style="color: #fff0f5;">)</span>;
<span style="color: #51afef; font-style: italic;">INSERT</span> <span style="color: #51afef; font-style: italic;">INTO</span> details <span style="color: #51afef; font-style: italic;">VALUES</span> <span style="color: #fff0f5;">(</span> <span style="color: #51afef; font-style: italic;">null</span>, <span style="color: #98be65;">'Julia'</span>, <span style="color: #98be65;">'Moore'</span>, 36, <span style="color: #98be65;">'F'</span>, <span style="color: #98be65;">'Administrator'</span>, <span style="color: #98be65;">'Science'</span>, 45.57, 38<span style="color: #fff0f5;">)</span>;

<span style="color: #51afef; font-style: italic;">SELECT</span> <span style="color: #98be65;">'CHECKING TO SEE IF EVERYTHING WORKED'</span> <span style="color: #51afef; font-style: italic;">as</span> <span style="color: #98be65;">'INFO'</span>;

<span style="color: #51afef; font-style: italic;">SELECT</span> * <span style="color: #51afef; font-style: italic;">from</span> details;
</pre>
</div>


<script src="../assets/jquery-3.3.1.min.js"></script>
<script src="../assets/notes.js"></script>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2017-09-11 Mon 12:14</p>
<p class="author">Author: Damian Chrzanowski</p>
<p class="date">Created: 2018-12-13 Thu 20:27</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
